[
  {
    "name": "La Quimera Early Access",
    "score": "4",
    "url": "https://www.ign.com/articles/la-quimera-review-early-access",
    "verdict": "La Quimera is bad, but it’s also a perfect example of how even something bad can have a bit of charm. The writing is cringey, the acting is embarrassing, and the middling but serviceable action tends to follow the same basic loop on repeat – but if some friends are riding this partially derailed train with you, there is still some fun to be found here. It doesn’t quite hit “so bad, it’s good” levels of jank, but it could still be a decent candidate for an evening of goofs. That said, even going into it with the right expectations, I wish there was any story resolution whatsoever, as La Quimera is clearly unfinished in more ways than one."
  },
  {
    "name": "Shotgun Cop Man",
    "score": "8",
    "url": "https://www.ign.com/articles/shotgun-cop-man-review",
    "verdict": "Shotgun Cop Man is a left field nostalgia trip that hits just about every shot from the volley it unloads — from its engaging, refined movement to its distinct level design ideas to its compelling time trials. That makes it all the more disappointing that it’s missing a couple of load-bearing features for any game that’s all about sanding down your runs to the last second, like a way to quickly restart from the start of a level after each death. Still, using firearms to fly through the air is a total blast, and I’m excited to get back to chasing better times and more precise runs through the underworld."
  },
  {
    "name": "Tempest Rising",
    "score": "6",
    "url": "https://www.ign.com/articles/tempest-rising-review-multiplayer",
    "verdict": "Tempest Rising’s multiplayer mode is a better looking but anemic version of the same exact style of RTS multiplayer we've been playing for 30 years. There's certainly value in that, since Command & Conquer’s fast-paced strategic action still holds up as well as ever, and matches are quick and tense when you’re up against an evenly skilled opponent. It may be a minimum viable product with only two factions and a handful of maps, but it is viable, and it remains a good time to duke it out as GDF and Dynasty with others or bots."
  },
  {
    "name": "Oblivion Remastered",
    "score": "8",
    "url": "https://www.ign.com/articles/the-elder-scrolls-iv-oblivion-remastered-review",
    "verdict": "The Elder Scrolls IV: Oblivion Remastered is an awesome nostalgic adventure that recaptures most of what I loved about the 2006 original, while sanding down many of its roughest edges. The result is a fantastic open-world RPG that’s aged quite well, with questlines and stories that are better than I remembered, modernizations (like the slightly improved leveling system) that remove some of the friction of the original, and loads of opportunities to make this adventure whatever you want it to be via the plentiful freedom afforded to you. On the downside, not enough has been done to make this thing significantly less buggy than it notoriously was back in the day, and some choices – like the enemy scaling and procedural Oblivion levels that become dull fast – have not been improved, which feels like a squandered opportunity. Even so, I never expected to so thoroughly enjoy replaying through this uniquely goofy RPG, and I am so, so glad I took this walk down memory lane (now with the option to sprint down it)."
  },
  {
    "name": "Clair Obscur: Expedition 33",
    "score": "9",
    "url": "https://www.ign.com/articles/clair-obscur-expedition-33-review",
    "verdict": "In so many ways, Clair Obscur: Expedition 33 reminded me of numerous classic and contemporary RPGs I love, but developer Sandfall truly understood why those games are special and made the pieces it borrowed its own. The creative turn-based combat system is brilliant, keeping me engaged while impressive visual flourishes bring it all together. The story can be a touch messy or melodramatic at times, but there’s an earnestness to how it frames mortality, grief, and the small moments of joy we find. It doesn’t shy away from the different, destructive ways we may handle loss, either – all of which is delivered through fantastic performances from an A-list cast that give its story the heart it needs to really hit. The contrast between its artistic sensibilities and old-school RPG design philosophy shows a clarity of vision, as if it was scoped just right to focus on the things that matter most, making it a true modern throwback. And so, Clair Obscur: Expedition 33 stands strong alongside its inspirations, and I hope that it too can be an inspiration for those who come after."
  },
  {
    "name": "Mandragora: Whispers of the Witch Tree",
    "score": "6",
    "url": "https://www.ign.com/articles/mandragora-whispers-of-the-witch-tree-review",
    "verdict": "Mandragora: Whispers of the Witch Tree is an interesting Frankenstein of action-RPG ideas that never quite comes to life. It’s easy to see the potential in everything from the grim and creepy setting, to the 2D soulslike mechanics, to the metroidvania exploration – but the actual execution of each is only skin deep, trying to juggle too many things at once and falling short for all of them. The intricate RPG systems and character classes do a lot of the heavy lifting for the otherwise subpar action, but even that can’t disguise the dull and repetitive combat, with weak boss fights that serve as flaccid finales to each level. There are plenty of good ideas in the dark fantasy world of Faelduum, but none of them come together in the way I’d hoped."
  },
  {
    "name": "Steel Seed",
    "score": "5",
    "url": "https://www.ign.com/articles/steel-seed-review",
    "verdict": "Steel Seed is cursed by mediocrity. Its combat is a low point, so abrasive that I’d rather restart whole areas when I got caught rather than have to navigate its jank. But it’s real problem is that everything else, from the bland characters and predictable story, to the forgettable locations that the tale takes you through, to the initially fun stealth sections that eventually wear thin, will lose the fight for a spot in my memory as soon as I’m done with this review. That’s a real shame, because there are a small handful of shiny chrome moments to find here, but they are buried under a whole lot of rust."
  },
  {
    "name": "Fatal Fury: City of the Wolves",
    "score": "8",
    "url": "https://www.ign.com/articles/fatal-fury-city-of-the-wolves-review",
    "verdict": "When it comes to all the most important parts of a fighting game, Fatal Fury: City of the Wolves is up there with the best of the genre. Its fighting system is a wonderful update to the classic SNK style of one-on-one combat that feels similar to Street Fighter 6, but just different enough to exist as an alternative to it; the roster of 17 is varied and interesting, even with the strange addition of two real life guest characters; and its netcode, while not on the same level as games like Street Fighter 6 and Guilty Gear Strive, is at least relatively close to it. Many things around that rock solid center are a bit behind the times, from the bare minimum teaching tools to an ugly menu UI that can be frustrating to engage with. But while that means Fatal Fury has some cobwebs to shake off from its 25-year hibernation, the end result is still an excellent return to the fighting game scene."
  },
  {
    "name": "Tempest Rising",
    "score": "7",
    "url": "https://www.ign.com/articles/tempest-rising-review-single-player-campaign",
    "verdict": "Tempest Rising’s two good-sized single-player campaigns are a large helping of comfort food for RTS fans old enough to remember Command & Conquer in its heyday, and a way for everyone else to sample a classic style we don’t see very often anymore without having to deal with any creaky old technology. Its nature as an homage to those games does mean that it’s not terribly ambitious when it comes to doing anything bold you won’t have seen before, but it does put its own interesting spin on faction design that kept me experimenting with abilities throughout the campaigns and prevented it from feeling like too much of a retread. The main place it disappointed an old C&C fan like myself was in its straight-faced mission briefings that can’t compare to the B-movie goofiness and memorable characters of the games that inspired it."
  },
  {
    "name": "Schedule 1 Early Access",
    "score": "8",
    "url": "https://www.ign.com/articles/schedule-1-review-early-access",
    "verdict": "Schedule 1 is a crime sim that mashes its dark subject matter and dirty jokes with surprisingly cozy management mechanics in a way that works really well, resulting in an extremely unique and highly amusing crafting game I happily sunk 40 hours into. Befriending my neighbors while getting them hooked on addictive substances grown in an apartment above a chinese restaurant is a goofy, satisfying hook, and leveling up my enterprise scratched an automation itch I don’t get to scratch often enough. This Early Access launch inevitably runs out of reasons to keep you playing since it’s quite clearly missing the back half of its campaign for now, and it has some bugs that give it a decidedly unpolished feel, but I still had a blast being an absolutely terrible human in the comfiest way possible."
  },
  {
    "name": "Commandos: Origins",
    "score": "8",
    "url": "https://www.ign.com/articles/commandos-origins-review",
    "verdict": "Commandos: Origins strikes a great balance between the classic stealth tactics games and modern streamlined ideas, creating tons of potential for finding creative solutions to problems like “too many living fascists.” Pruning out elements like inventory management may not be to every older fan’s tastes, but that’s focused a spotlight on strict stealth – and it’s here Origins shines. Sneaking through its massive maps, each of which are swarming with hundreds of enemies, takes hours and hours of patient planning and careful clicking. I regularly gleaned a ton of pleasure from executing a perfect coordinated strike and fading away into the background, with the remaining Nazis none the wiser. No plan survives contact with this many bugs, but quick-loading will get you past nearly any issue and this otherwise might be the sneakiest fun you can have going commando with your underwear on."
  },
  {
    "name": "Blue Prince",
    "score": "9",
    "url": "https://www.ign.com/articles/blue-prince-review",
    "verdict": "Blue Prince is the kind of puzzle game that dug deep into my brain and didn’t let go. Its complex mysteries weave brilliantly into the careful decision making of how to lay out the mansion’s rooms on each randomized run, leaving me building floorplans in my sleep almost every night after I played it. The story that slowly emerges within this fascinating place is also a compelling one, and it had me hungrily hunting for clues and combinations for many hours after I reached the credits while also poetically tying into the mechanics that lead you to them. Hitting a dead end you did everything in your power to avoid can frustrate from time to time, but this sprawling estate has so much to uncover that the randomness never stalled my progress for too long. If The Witness, Portal, and Myst are already emblazoned on the Mount Rushmore of first-person puzzle games, I wouldn’t be surprised to see Blue Prince carved alongside them soon enough."
  },
  {
    "name": "South of Midnight",
    "score": "8",
    "url": "https://www.ign.com/articles/south-of-midnight-review",
    "verdict": "South of Midnight is a straightforward but well-executed action-adventure game on the surface, with a simple but satisfying mix of combat and platforming. It’s focused, filling out its 12-hour runtime nicely without ever dragging or relying on unnecessary padding. Beyond those basics, however, is a certain heart and artistry that elevates the whole package, inviting you to peer into the deep American South through its folklore, nature, and culture. It might not be the most profound exploration of family life, but it’s delivered in ways that feel authentic. From its striking art style to the evocative tunes that bring big story moments together, Hazel’s journey is a captivating one no matter where you come from."
  },
  {
    "name": "The First Berserker: Khazan",
    "score": "8",
    "url": "https://www.ign.com/articles/the-first-berserker-khazan-review",
    "verdict": "After finding my footing and gaining some abilities that made me feel like I could stand a chance against anything, I came to love The First Beserker: Khazan’s devastating bosses. They’re the reason to play this brutal but impressive soulslike, and they only get better and more mechanically satisfying as you go. It can be a steep and demoralizing climb, especially in the early hours, but there’s an exhilaration in executing split-second guards and dodges to escape relentless attacks before hitting my foes with my own flurry of steel. Learning to take on the worst Khazan threw at me at the start gave me the confidence to press on, and I’m so glad I kept with it. The First Berserker: Khazan is undoubtedly the hardest game I’ve played this year, but it’s one I encourage fans of the genre (or even those just curious about it) to play. The journey is tough, and it won’t be for everyone – but if I can get through it, with plenty of time and practice, you can too."
  },
  {
    "name": "Bleach Rebirth of Souls",
    "score": "7",
    "url": "https://www.ign.com/articles/bleach-rebirth-of-souls-review",
    "verdict": "Bleach Rebirth of Souls’ combat surpasses the typical anime arena fighter thanks to its intricate battle system and the effort that has been invested in making each character feel unique with their distinct play styles. Although the theatrics of its story mode do not consistently match the spectacle of its crisp character models, the vibrant sword slashes and stylish typography accompanying each super move help compensate for those shortcomings. Despite not fully delivering on its ambitious promise to elevate anime arena fighters to new heights, Rebirth of Souls is still a welcome latecomer to the genre for this series."
  },
  {
    "name": "in",
    "score": "6",
    "url": "https://www.ign.com/articles/inzoi-review-early-access",
    "verdict": "inZOI is by no means perfect, but it is impressive. It’s Early Access launch is a mish-mash of unfinished ideas and engaging mechanics, and I am at least still finding little surprises 30 hours in. The character creator and build mode are already complex and relatively user-friendly, and the Karma system is a clever way to introduce drama into the world, but inconsistent behaviours across its uncanny locations and conversation topics don’t put those good ideas in the best light. What inZOI offers right now is an enticing slice of something that could eventually be great, and it’s worthwhile enough if your main interest is curating realistic dioramas to pose your custom Zois in like dolls. However, if you're looking for the moment-to-moment depth of something like The Sims, you’ll need to let Krafton keep cooking for some time yet."
  },
  {
    "name": "Wreckfest 2 Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/wreckfest-2-early-access-review",
    "verdict": "As a huge fan of developer Bugbear since the original FlatOut in 2004, Wreckfest 2 is definitely already speaking my language – and it really does feel great when you’re in the thick of it, crashing and carving your way through rival cars and destructible scenery on a scale I’ve never seen before. The slim amount of content and abundant crashes to desktop in the early access launch, however, make Wreckfest 2 in its current form more of an investment in what’s to come than an imperative you should change course to experience today. It leaves a mark on first impact, but a few sessions later and I feel like I’ve squeezed all the fun I’m going to glean out of it for now."
  },
  {
    "name": "Atomfall",
    "score": "8",
    "url": "https://www.ign.com/articles/atomfall-review",
    "verdict": "Atomfall is a gripping survival-action adventure that takes some of the best elements of Fallout and Elden Ring, and synthesises them into its own fresh mutation. It presents a picturesque chunk of English countryside littered with alluring structures to pique and reward your curiosity, eccentric locals to meet, and absorbing mysteries to unravel, and uses classic iconography from British sci-fi and horror to consistently unsettling effect. In spite of some enemy behaviours that are occasionally less stable than a reactor in meltdown, Atomfall is a compelling, post-apocalyptic survival story that satisfyingly bends to your choices and discoveries no matter which direction you take."
  },
  {
    "name": "Kaiserpunk",
    "score": "5",
    "url": "https://www.ign.com/articles/kaiserpunk-review",
    "verdict": "While it has some cool ideas, a unique aesthetic, and often rewarding production chain management, Kaiserpunk definitely is not ready for the front lines in its current state. There are huge, save-killing bugs. The interface lacks what I would consider to be some fairly basic functionality. And the often strong city-building layer doesn't harmonize well at all with the over-scoped and cumbersome strategic map. Maybe some substantial patches could theoretically let me recommend Kaiserpunk on its strengths as a city builder with a novel premise. But for now, I can't even really do that. The trenches may have vanished under the plow, but playing Kaiserpunk still leaves me feeling shell-shocked."
  },
  {
    "name": "Assassin's Creed Shadows",
    "score": "8",
    "url": "https://www.ign.com/articles/assassins-creed-shadows-review",
    "verdict": "Assassin’s Creed Shadows takes a flashing blade to the series’ established norms, trimming them to a more precise form in lieu of chopping them down outright. Combat is aggressive and requires more intentional parrying and skill management than in the past, and exploring the gorgeous provinces of Sengoku-period Japan is encouraged thanks to the revamped map that deemphasizes collecting icons and checking off lists. Naoe and Yasuke are well-realized and memorable protagonists, even though most of the story they drive follows pretty predictable paths. Both have unique playstyles that bolster each other’s weaknesses, but they are ultimately imbalanced by the fact that you can make use of the stealth and exploration skills of the master shinobi far more than the superhuman strength of the samurai. This isn’t the Assassin’s Creed that will change the minds of folks that never connected with the series before, but for those of us with lots of hours logged in the Animus, the sum of Shadows’ parts provide a refreshing realignment of the series that you should not skip."
  },
  {
    "name": "FragPunk",
    "score": "7",
    "url": "https://www.ign.com/articles/fragpunk-review",
    "verdict": "In the heat of the action, FragPunk feels great. The hilariously mad Shard Cards make every round distinct, and with so many potential combinations, it is hard to imagine its signature game mode growing tiresome any time soon. It’s just a shame that the economy and reward systems built around it are such a mess, and the unlockables that you are supposed to work towards earning aren’t very interesting. It’s still exciting to play, especially when all eyes fall on you in a match-ending Duel – but when the thrill of victory alone loses its luster, there isn’t a compelling reason to stick around for the long haul unless what you earn and how you earn it changes significantly."
  },
  {
    "name": "Wanderstop",
    "score": "9",
    "url": "https://www.ign.com/articles/wanderstop-review",
    "verdict": "Every inch of Wanderstop pushes the conventions you’d expect of similarly wholesome games. Its vibrant colors, quirky characters, and enchanting music are used to tell a compelling story that forces you to grapple with both its lead character's insecurities as well as your own. It’s a powerful adventure not just about burn out, but about how deeply painful it is to free ourselves from coping mechanisms that may have previously kept us secure. At the same time, Wanderstop’s simple but satisfying tea brewing experimentation serves as a safe and entertaining space to do that deep digging. There aren’t many games like Wanderstop out there currently, but for all our sakes, I hope there will be soon."
  },
  {
    "name": "Carmen Sandiego",
    "score": "7",
    "url": "https://www.ign.com/articles/carmen-sandiego-review",
    "verdict": "Carmen Sandiego’s latest adventure harkens back to the series’ origins while modernizing it in a few key ways. It could do with some refinement, as some of the activities are more fun than others, but it’s overall an enjoyable (if simple) detective game that will test your knowledge and tease your brain. For kids, Carmen Sandiego offers an age-appropriate challenge that makes learning entertaining — just like the edutainment genre set out to do so many years ago. For kids at heart, it’s a breezy adventure that’s worth dusting off your virtual passport and taking another trip around the world."
  },
  {
    "name": "Split Fiction",
    "score": "9",
    "url": "https://www.ign.com/articles/split-fiction-review",
    "verdict": "An expertly crafted and absorbing co-op adventure that pinballs from one genre extreme to another, Split Fiction is a rollercoaster of gameplay ideas and styles that are usually discarded as quickly as they’re introduced. This keeps it fabulously fresh for its full, 14-hour duration. With no idea sticking around long enough to get stale before making way for the next, it’s a victory of imagination and restraint in equal measure. Hazelight may have been rewriting the co-op rule book for a decade now, but Split Fiction is a new chapter that you (and a partner) cannot miss."
  },
  {
    "name": "Two Point Museum",
    "score": "9",
    "url": "https://www.ign.com/articles/two-point-museum-review",
    "verdict": "Two Point Museum is a rewarding, deep, challenging, and highly entertaining tycoon game that demonstrates Two Point Studios has really hit its groove with this third iteration of the idea. The variety of different exhibits to unlock and level up, the thrill of discovering new expedition maps, and the array of clever and easy-to-use management tools make designing and running a museum joyful and consistently rewarding. I've sunk more than 40 hours into it already and I could easily see doubling that without running out of stuff to do. Call the curator. They're really going to want to take a look at this."
  },
  {
    "name": "Warriors: Abyss",
    "score": "7",
    "url": "https://www.ign.com/articles/warriors-abyss-review",
    "verdict": "Warriors: Abyss may stumble in its open-ended, cookie-cutter story and cut-and-paste boss battles, but the replayability that comes from its combat and the customization of its multitude of characters and builds helped keep me slashing through thousands of enemies for dozens of hours of roguelite runs. It's always great to see a long-running series like Dynasty Warriors experimenting with new genres because it often leads to innovation, and Abyss does succeed overall with adapting the ideas of a massive roster of characters and over-the-top Mousu action. However, not enough of the other elements of a genuinely excellent action roguelite line up here to make it the kind I return to for months."
  },
  {
    "name": "Monster Hunter Wilds",
    "score": "8",
    "url": "https://www.ign.com/articles/monster-hunter-wilds-review",
    "verdict": "Monster Hunter Wilds continues to smooth off the traditionally rough edges of the series in smart ways, reducing as much friction as possible that could get in the way of you grabbing any of its exceptionally fun weapons and planting them firmly in a monster’s hide. But in that quest to make Monster Hunter more approachable, Wilds has carved a little too close to the bone in some places, trimming its challenge back so much that I barely needed to dig into its in-depth equipment system at all this time to become an apex predator. Its more flexible combat is some of the most fun I’ve had with the series, but like the blustering lighting storms of its gorgeous desert, it'll burns brightly but briefly until Capcom unleashes some real endgame beasts to challenge us."
  },
  {
    "name": "Like a Dragon: Pirate Yakuza in Hawaii",
    "score": "8",
    "url": "https://www.ign.com/articles/like-a-dragon-pirate-yakuza-in-hawaii-review",
    "verdict": "Propelled by a breezy and often completely bananas treasure-hunting tale, Like a Dragon: Pirate Yakuza in Hawaii is a delightful spin-off that seamlessly shifts between street thuggery and skulduggery. Majima’s Sea Dog stance is one of the most fun and flexible fighting styles I’ve enjoyed in the series to date – at least in its classic, combo-based form – and I welcomed the challenge of carefully balancing my crew lineup in order to survive the many turbulent naval battles. While its overworld maps feel a little padded out with recycled island settings, Honolulu itself is jammed with unpredictable substories and overhauled activities that meant every moment of shore leave was full of surprises. Absolutely heaving with buried treasures and varied pleasures, Like a Dragon: Pirate Yakuza in Hawaii is a consistently captivating voyage that kept my timbers shivering whether on land or at sea."
  },
  {
    "name": "Avowed",
    "score": "7",
    "url": "https://www.ign.com/articles/avowed-review",
    "verdict": "With awesome worldbuilding and stellar character writing, Avowed reminds me why I fell in love with Obsidian’s RPGs in the first place. However, the bigger picture is that it plays it quite safe, with a by-the-numbers fantasy adventure that’s more familiar than evolutionary, and there’s bear-ly any enemy variety to keep its swords-and-sorcery battles interesting for long. Even if it doesn’t swing for the fences or leave a memorable mark on the genre, though, it’s still perfectly competent with all the tried-and-true stuff I expect, including chaotic combat, leveling systems and a loot progression that lets you build the kind of character you want to play, and meaningful decisions that can have a massive impact on the world. Plus, the whole thing’s surprisingly technically stable compared to its reliably unreliable peers. I enjoyed my time parkouring my way through Eora and think you will too – just don’t expect Avowed to show you anything you haven’t seen before."
  },
  {
    "name": "Synduality Echo of Ada",
    "score": "7",
    "url": "https://www.ign.com/articles/synduality-echo-of-ada-review",
    "verdict": "Synduality Echo of Ada is a tense extraction shooter with a cool sci-fi premise. Its mech-based action plays well, but the early grind is an absolute slog and upgrades are always slow to unlock, even if you’re not dying much. My drive to play even started to die after a while because I was forced to do the same things on repeat. But I powered through that part and I’m ultimately glad I did, because what comes after that slow opening is great. There’s nothing quite like smoking some poor sucker who picks a fight with you in single combat. Oh, and if you’re rolling with stuff you really like, please buy insurance. It’s a scam, but it may save your life – or at least your mech. And in the world of Synduality, that’s really all you have."
  },
  {
    "name": "The Legend of Heroes: Trails through Daybreak 2",
    "score": "7",
    "url": "https://www.ign.com/articles/the-legend-of-heroes-trails-through-daybreak-2-review",
    "verdict": "The Legend of Heroes: Trails Through Daybreak 2 makes a few missteps with the pacing and structure of its multiversal story, but it’s buoyed by a focus on quality character moments and impressive worldbuilding over earthshaking reveals. The turn-based combat and party customization haven’t changed much at all, but they didn’t really need to, and the real-time action side of things has seen some small but meaningful improvements. Daybreak 2 didn’t move the needle in the overall Calvard saga as much as I hoped, but this more personal story is still another good entry in the Trails series overall."
  },
  {
    "name": "Tokyo Xtreme Racer Early Access",
    "score": "8",
    "url": "https://www.ign.com/articles/tokyo-xtreme-racer-early-access-review",
    "verdict": "Tokyo Xtreme Racer is an infectiously addictive time capsule of a racing game that needs little more than a bit of menu refinement and some major aggression injected into its sound to really soup it up and prep it for even more classic Japanese cars to race in and against. In fact, it’s already well worth its early access asking price. It’s narrow in scope, but its highway battle hook makes it hard to put down, and its total lack of modern baggage like microtransactions and tacked-on multiplayer is outright refreshing."
  },
  {
    "name": "Kingdom Come: Deliverance 2",
    "score": "9",
    "url": "https://www.ign.com/articles/kingdom-come-deliverance-2-review",
    "verdict": "In many ways, Kingdom Come: Deliverance 2 feels like it’s picked up and run with the reactive first-person RPG torch that Bethesda left lying in the mud years ago in pursuit of a broader audience. And it has excellent melee combat, which The Elder Scrolls never came close to even at its peak. Sometimes it's not sure if it wants to be a cinematic tale about a specific guy going on a specific adventure or a truly dynamic open-world sandbox packed with interesting and varied side quests, and that can lead to a few immersion-shattering conflicts. But most of the time, leaning into one doesn't get in the way of the other, and you’re free to go on any of its many optional adventures along the way to a thought-provoking and rousing finale for the main plot. I was delighted to get lost in its world, and it will be a long time before I forget its exceptional story."
  },
  {
    "name": "Civilization 7",
    "score": "7",
    "url": "https://www.ign.com/articles/civilization-7-review",
    "verdict": "With Civilization 7, the desire to streamline and simplify this legendary 4X series feels like it has gone a bit too far, particularly when it comes to the interface. It’s frustratingly inadequate at providing me with the information I need to play well, or even understand what's going on sometimes. Even so, it does have improved warfare and diplomacy, a bit of added narrative flair, as well as mostly gorgeous graphics and sound, so it can still give me reasons to keep clicking one more turn late into the night. There’s good reason to believe that with Firaxis’s usual pace of patches and expansions it can refine its new ideas and become everything it ought to be, and while what’s here right now is at least still a fun time, it’s also a bigger step backward for the series than we’re accustomed to when a new age dawns."
  },
  {
    "name": "Citizen Sleeper 2: Starward Vector",
    "score": "8",
    "url": "https://www.ign.com/articles/citizen-sleeper-2-starward-vector-review",
    "verdict": "Citizen Sleeper 2: Starward Vector does not stray too far from what made the first one a cult hit, but it doesn’t need to. It tells a rich and poignant story about the complex nature of control on one’s self when that self is a machine that can be rebooted and hacked, finding and enriching community in the face of overwhelming odds, and expressing personhood both to oneself and to others. It’s visual novel-like presentation is heavy on reading and dice rolling, so its not exactly pulse-pounding, but the retooled character classes and stats, new crew missions, and stress mechanics provide just enough feedback and create a sense of precarity throughout that it stays engaging."
  },
  {
    "name": "Hello Kitty Island Adventure",
    "score": "6",
    "url": "https://www.ign.com/articles/hello-kitty-island-adventure-review",
    "verdict": "For fans of Sanrio's lovable cast of characters, Hello Kitty Island Adventure might scratch an itch left in the wake of Animal Crossing: New Horizons in the broadest sense. On the surface, its large and colorful world, cutesy critters, and never-ending to-do list feel energetic and new. But sadly, that surface is all there is. A shallow pool of endless gifting and mindless tasks are locked behind daily progression gates to distract you from the fact that you are, in fact, never getting anywhere fast."
  },
  {
    "name": "Assetto Corsa Evo Early Access",
    "score": "6",
    "url": "https://www.ign.com/articles/assetto-corsa-evo-early-access-review",
    "verdict": "Assetto Corsa Evo already feels absolutely fantastic behind the wheel but, with aggravating AI opponents slamming into you every which way and hamstrung as it is by online-only features that are currently inaccessible, it doesn’t feel like an essential early access purchase. The handling may be excellent, but I’ll be parking it up and waiting for the finished product – including the promised epic-sized map of Germany – before I put the keys back in the ignition."
  },
  {
    "name": "Ninja Gaiden 2 Black",
    "score": "8",
    "url": "https://www.ign.com/articles/ninja-gaiden-2-black-review",
    "verdict": "Ninja Gaiden 2 Black is neither Ninja Gaiden 2 nor Ninja Gaiden Sigma 2, but instead a secret third thing that mixes both versions together to create something that is wholly unique and by far the most beautiful version of this excellent action game yet. While I have a hard time calling it the definitive release because I prefer the original’s “more dudes who are more aggressive but die faster” approach, Ninja Gaiden 2 Black is a definite improvement over the Sigma 2 release, fixes several long-standing issues, and unlike the original, isn’t trapped on the Xbox 360. It isn't the version I was hoping for (get on it, modders), but it is still an incredible game and I'm happy it exists. If this really is it for Ninja Gaiden 2, it will at least go out on a high note. This trip through time reminded me that while you can't go home again, and nothing will ever truly be like it was, that doesn't mean something can't still be beautiful. Ninja Gaiden 2 is remarkable, even with its flaws, and it's good to finally have it back in Black."
  },
  {
    "name": "Rift of the NecroDancer",
    "score": "8",
    "url": "https://www.ign.com/articles/rift-of-the-necrodancer-review",
    "verdict": "I could wear out my keyboard slapping arrow keys to the beat and jamming in my seat to Rift of the NecroDancer’s excellent soundtrack, fervently chasing down a perfect run of a song for hours. Whether I was fighting stuffy puppet masters, rhythmically ridding the world of monsters, or just waddling around in a silly mole costume, it provides many excellent flavors of arcade-style rhythm action. Even though this “Greatest Hits” anthology isn’t as focused or Earth-shattering as Brace Yourself Games’ genre-bending debut album, it still continually surprised and delighted me by providing clever twists on time-tested mechanics."
  },
  {
    "name": "The Stone of Madness",
    "score": "6",
    "url": "https://www.ign.com/articles/the-stone-of-madness-review",
    "verdict": "The Stone of Madness has some excellent art and great moments of sneaking around. But what should have been a fairly replayable and interesting prison break ends up buckling under the weight of its technical problems. Progress-halting bugs, graphical issues, and finicky controls all turn otherwise-engaging sneaking missions into frustrating excursions. With some extra tuning, The Stone of Madness could be a refreshing take on tactical stealth. As-is, there are too many obstacles getting in the way of what’s good here."
  },
  {
    "name": "Eternal Strands",
    "score": "7",
    "url": "https://www.ign.com/articles/eternal-strands-review",
    "verdict": "When Eternal Strands is good, it’s very good, thanks to exciting boss fights that iterate upon Shadow of Colossus’s gigantic encounters better than just about any of the other games that have used it as inspiration. While its story is underwhelming and some aspects of its gear progression are especially convoluted, the combat is built on an extremely strong foundation thanks to a versatile set of powers that encourage and reward creativity, especially in the showstopping Great Foe battles. The novelty does begin to fade after a while, especially when you’re forced to fight those same bosses and enemies again in the same locations, occasionally with frustrating weather effects, but the high points of Eternal Strands mitigate the low points enough to still make it an action RPG that’s easy to recommend."
  },
  {
    "name": "Sniper Elite: Resistance",
    "score": "6",
    "url": "https://www.ign.com/articles/sniper-elite-resistance-review",
    "verdict": "Sniper Elite: Resistance is a modest retread for the Sniper Elite series, rather than an exaggerated goose step forward. A near total lack of innovation makes Resistance seem like little more than a Sniper Elite 5 remix, rehashing everything from the skill tree to the traps and enemy types, and serving up some sniping sandboxes that are for the most part a bit too similar to locations that have featured in the series’ prior entries. Its bonus propaganda missions are fun but fleeting, and its X-ray kill-cam still blasts balls and brains to bits but no longer blows my mind. Those only just getting on board with the series will undoubtedly find a bit more to like, but I’d argue that on balance, Sniper Elite 5’s superior story sandboxes and otherwise similar feature set makes it a much better buy even three years on from its release. Sniper Elite: Resistance is a solid stealth-based shooter, but it fails to set its sights high enough in order to pull off a truly spectacular execution."
  },
  {
    "name": "Orcs Must Die! Deathtrap",
    "score": "7",
    "url": "https://www.ign.com/articles/orcs-must-die-deathtrap-review",
    "verdict": "Orcs Must Die! Deathtrap's roguelite spin on the action-tower defense series works pretty well. Even if most of its traps and endless parade of highly killable enemies are carried over from past games, the new Warmages' abilities and the combined impact of its randomized modifiers can really shake things up nicely for quite a few runs. Puzzling out how to steer the orcs to their doom and then taking part in the bloody carnage is as much fun here as it is in the rest of the series. I did lose steam due to the slow meta progression and the increasingly long series of missions where the first ones are too easy and the latter ones got frustrating because of bullet-sponge enemies, but that was only after a few dozen hours of happily chewing up orcs and spitting them out both solo and in co-op."
  },
  {
    "name": "Hyper Light Breaker Early Access",
    "score": "4",
    "url": "https://www.ign.com/articles/hyper-light-breaker-review-early-access",
    "verdict": "At its early access launch, Hyper Light Breaker is a sloppy roguelite that makes poor use of the Hyper Light world I adore. Combat is messy and repetitive, bosses are cheesy and frustrating as all get out, the procedural worlds feel awkward to explore, and both loot and progression are half-baked. Cover all of that in a thick layer of the usual work-in-progress technical problems, and you’ve got yourself a particularly rough package, even when accompanied by friends. Riding around on a hoverboard while taking in the colorful scenery can give way to some enjoyable moments, so I’ve still found reasons to be hopeful things could be polished to a more impressive shine over the course of Hyper Light Breaker’s early access development. But for now, you might want to wait and see if there’s a hyper light at the end of this tunnel."
  },
  {
    "name": "Aloft Early Access",
    "score": "6",
    "url": "https://www.ign.com/articles/aloft-review-early-access",
    "verdict": "Aloft is a promising blend of a survival crafting game and cozy sensibilities with a memorable airborne setting, but it misses the mark in quite a few other places as of its early access launch. Turning any floating island into your own personal flying pirate ship is very satisfying, and mixing survival mechanics with low-stakes, feel-good charm is a potent combination. That said, with weak and repetitive combat encounters, a scarcity of things to keep you busy, and loads of technical issues, there’s a lot of room left for improvement that can be a little tough to endure at the moment. There are enough good ideas here that I’m optimistic Aloft could be quite worth your time at some point in the future, but right now you might want to wait for stronger winds to blow before setting sail."
  },
  {
    "name": "Dynasty Warriors: Origins",
    "score": "9",
    "url": "https://www.ign.com/articles/dynasty-warriors-origins-review",
    "verdict": "If Dynasty Warriors: Origins is meant to be a new beginning, it’s one that gets off to a masterful start. It doesn’t just have the largest amount of enemies the series has thrown on screen at once, it also deepens its combat, improves its storytelling without getting in the way of the action, and provides a healthy amount of replayability and postgame content – all while looking better than ever. Your amnesiac hero is a bit too much of a blank slate at times, but the impressive ensemble cast made this story sing as I grew to care about the characters around him, big and small. Origins is both a great entry point for newcomers and a triumphant return for veterans like me who felt the last few entries had become stale or missed the mark. It feels like the series I once loved is finally back."
  },
  {
    "name": "Alien: Rogue Incursion",
    "score": "7",
    "url": "https://www.ign.com/articles/alien-rogue-incursion-review",
    "verdict": "Alien: Rogue Incursion is a faithful and entertaining stab at bringing Alien to virtual reality. The excellent story, spot-on Alien environments, and creepy Xenomorphs keep the horrifying times going throughout its eight-hour duration, even when repetitive combat, predictable AI, and the odd bug here and there make it clear this is the first attempt that it is. But while there’s plenty of room for this budding series to grow, I can already happily recommend Rogue Incursion as a strong proof of concept to Alien fans and newcomers alike – one that’s left me eagerly awaiting part two."
  },
  {
    "name": "Mouthwashing",
    "score": "9",
    "url": "https://www.ign.com/articles/mouthwashing-review",
    "verdict": "Mouthwashing is grimy, uncomfortable, and incredibly compelling. The genuinely unpleasant actions you’re forced to perform may be deeply unsettling (and at times a little frustrating), but they aren't gratuitous, used to make powerful points in a way games are uniquely suited to. Combine that with a smart lo-fi visual style, eerily muffled sound design, and simple but direct writing and Mouthwashing paints a picture of who we can be in our worst moments – and it doesn’t let us get away with it."
  },
  {
    "name": "Delta Force",
    "score": "7",
    "url": "https://www.ign.com/articles/delta-force-review-2024",
    "verdict": "Delta Force isn’t the best extraction shooter, nor does it do big PvP battles the best. However, doing both of those modes reasonably well in one free-to-play package is pretty unique. The massive, vehicle-filled battles are respectable fun – especially in Attack and Defend – as long as you can get comfortable with the more realistic shooting mechanics and how they mix with fantastical powers. The Operations, meanwhile, make for one of the most formulaic and accessible extraction shooters I’ve played, though the great levels are wasted on too much direction toward the only worthwhile loot, and upgrading the Black Site is more of a chore than an aspiration. Still, it’s a good option for either, and deserves credit for doing a solid, if unspectacular and not especially imaginative job, of two very different first-person shooter styles."
  },
  {
    "name": "Marvel Rivals",
    "score": "8",
    "url": "https://www.ign.com/articles/marvel-rivals-review",
    "verdict": "Neither the MCU nor the hero shooter genre are at the glorious heights experienced by both in the past decade, but that isn’t stopping Marvel Rivals from doing everything it can to be a success story today. Approachable, yet with a high skill ceiling to reach for, it's consistently a great time no matter which fan-favourite comic book character and accompanying skillset is at your fingertips. It may be following closely in the slipstream of the hero shooters that have come before it, but by doing so Rivals has firmly placed itself in a strong position to take the crown for itself."
  },
  {
    "name": "Mighty Morphin Power Rangers: Rita’s Rewind",
    "score": "8",
    "url": "https://www.ign.com/articles/mighty-morphin-power-rangers-ritas-rewind-review",
    "verdict": "Mighty Morphin Power Rangers: Rita’s Rewind nails the look and feel of both Power Rangers and the classic arcade games it’s drawing inspiration from. While the Super Scaler levels can be a bit of a mixed bag, they sing when they work, and they’re still only manageably frustrating when they don’t. Everything else, though, rules — the gorgeous sprite work, bumping soundtrack, rock-solid beat ‘em up gameplay, in-jokes for fans, and other little touches like playable in-universe arcade games. And while nostalgia will certainly enhance the experience for some, you don’t have to know your Green Ranger from your Black Ranger to enjoy it. It might even give you an itch to revisit the classic games, or give the original television series a watch. You may not be able to go down to your local arcade anymore, but if Rita’s Rewind is any indication, you can always go back in time. Just pack some spandex."
  },
  {
    "name": "Path of Exile 2 Early Access",
    "score": "8",
    "url": "https://www.ign.com/articles/path-of-exile-2-review-early-access",
    "verdict": "At its early access launch, Path of Exile 2 is already shaping up to be the sequel we’ve been waiting for. Everything from the refined fundamental action-RPG gameplay to the surprisingly fleshed-out endgame has seen major improvements, and the half of the story we’ve got so far shows plenty of promise, even if the setting feels a little generic in the realm of dark fantasy worlds. The downside of playing in early access, though, is that you’ll have to slog through all three acts twice to reach the endgame, the loot game needs some major tweaking to more consistently reward us with usable items, and some mild-to-severe technical wonkiness might take the wind out of your sails if things go awry – but it’s nothing that makes me concerned for the future of this expansive sequel. Even while we wait for 1.0, Path of Exile 2 is already a stellar way to lose dozens of hours and a clear leap forward for the series."
  },
  {
    "name": "Indiana Jones and the Great Circle",
    "score": "9",
    "url": "https://www.ign.com/articles/indiana-jones-and-the-great-circle-review",
    "verdict": "Indiana Jones and the Great Circle nails nearly everything about the best parts of the storied franchise upon which it’s based, from the title card and location fonts to Harrison Ford’s finger waggle, but its successes go way beyond its faithfulness to the finer points of the films. With a host of gorgeous and lavishly detailed levels, satisfying combat hinged on jawbreaking haymakers, and a focus on slow-paced exploration, platforming, and puzzle solving (interspersed with a handful of high-voltage action scenes), The Great Circle is an irresistible and immersive global treasure hunt for Indy fans who’ve felt underserved by the likes of The Dial of Destiny and Kingdom of the Crystal Skull. Moreover, it sets itself apart from this decade’s increasingly homogenised third-person action games by opting for a classic first-person perspective inspired by the likes of The Chronicles of Riddick: Escape from Butcher Bay. If you butt your head against its generally basic stealth systems, cracks will show – but when played as intended, The Great Circle immediately ranks amongst the best Indiana Jones games ever and its story is closer to Raiders of the Lost Ark and The Last Crusade than anything that’s come after. Some pundits may claim it belongs in a museum, but museums are for dusty old relics you shouldn’t ever touch. The Great Circle doesn’t belong in a museum; it belongs on your hard drive where you can play the heck out of it."
  },
  {
    "name": "Microsoft Flight Simulator 2024",
    "score": "9",
    "url": "https://www.ign.com/articles/microsoft-flight-simulator-2024-review",
    "verdict": "We have hit cruising altitude. You can safely unbuckle your seatbelts and move freely about the cabin. I was extremely skeptical as to whether or not Asobo could capture the lightning in a bottle of 2020’s Microsoft Flight Simulator again – but after Microsoft Flight Simulator 2024 took the time to clean up its launch problems and I really got to know its new features, I am once again astonished. It's more than just simulating the experience of flying: you can use it to learn the technical side of how pilots actually fly planes, including the stuff that doesn't involve ailerons and elevators and trim thanks to the EFB and Flight Planner. When I encounter some new term I don't understand, all it does is make me want to learn more so I can fly virtual airplanes on a digital twin of the planet Earth with as much realism as is possible. It's not flawless, with some lingering problems in those new systems and tutorials that are lacking (or worse, nonexistent, making Google a constant companion). But I am still in awe of what's here, and I cannot wait to spend hundreds of hours exploring it."
  },
  {
    "name": "Infinity Nikki",
    "score": "9",
    "url": "https://www.ign.com/articles/infinity-nikki-review",
    "verdict": "Infinity Nikki is the ultimate evolution of the incredibly successful series that came before it. It is the peak free-to-play dress-up game, and while it’s still full of a few too many currencies and all the gacha pulls you’d expect from its mobile roots, it's all in service of building a gorgeous, gigantic wardrobe worth getting excited about. It features some of the most intricate, detailed outfits in any game I've seen, and while unlocking them can require a lot of grinding (or some real-world money) depending on the outfit, that just means time spent joyfully exploring its packed open world. There's always something new and either cute or bizarrely dark to discover, and even after dozens of hours I'm still unraveling its secrets. Infinity Nikki is perfectly girly positivity rolled up in a pink and sparkling package, and regardless of if that is something you've wanted, it might just be what you need."
  },
  {
    "name": "Dragon Quest",
    "score": "9",
    "url": "https://www.ign.com/articles/dragon-quest-3-hd-2d-remake-review",
    "verdict": "Dragon Quest III HD-2D Remake is the best-case scenario for a faithful remake of a classic roleplaying game, and a shining example for developers to follow when setting out to revisit old, beloved adventures. It spruces up the 36-year-old original with great quality-of-life improvements that enhance the journey without unrecognizably transforming it, along with a beautiful new coat of paint that proves Dragon Quest and the HD-2D art style are a perfect match. But it only works as well as it does because Dragon Quest III is still an incredible RPG in its own right, with great turn-based battles, a highly-adaptable class system, and an intriguing world to uncover that’s littered with secrets. There are only a few areas where I wish it felt a bit more modern, like the clunky inventory management and your party’s lack of personality, but I still respect its unflinching dedication to the original’s vision. Remakes may be all the rage right now, but Dragon Quest III HD-2D Remake still confidently stands among the best of them, and is a perfect reminder of why the original is one of the most important RPGs in the genre."
  },
  {
    "name": "Lego Horizon Adventures",
    "score": "7",
    "url": "https://www.ign.com/articles/lego-horizon-adventures-review",
    "verdict": "Lego Horizon Adventures reimagines Horizon Zero Dawn with a playful Lego twist, simplifying the story while keeping the heart of its key moments and characters. Combat feels great and offers plenty of difficulty options for players of all skill levels. While the randomness of gadgets and rare weapons can be an annoyance, especially when trying to complete certain challenges, it’s cute that the use-what-you-can-find nature of Horizon has been embraced. There are also plenty of customization options for your characters and the hub town, which was enjoyable as I strived to make Mother's Heart my own. Couple that with visually impressive levels full of excellent music but disappointingly predictable level design and a lack of extras and I ultimately found myself having fun with Lego Horizon Adventures even if I was left wanting more."
  },
  {
    "name": "Empire of the Ants",
    "score": "6",
    "url": "https://www.ign.com/articles/empire-of-the-ants-multiplayer-review",
    "verdict": "Empire of the Ants’s multiplayer modes have some clever ideas for how insects do battle, having you scurry around as a commander giving orders and casting buffs on your legions of bugs. Managing its deceptively small-scale battles presents some interesting challenges, and the impressive, hyper-realistic graphics are let down only by animations that grow repetitive after a few matches. What undermines it most is the lack of unit variety and multiplayer modes, which don’t include multiple bug factions or any options to play as a team or against a competent AI. Without that, it’s hard to see this game having a lot of legs."
  },
  {
    "name": "Empire of the Ants Single",
    "score": "3",
    "url": "https://www.ign.com/articles/empire-of-the-ants-single-player-campaign-review",
    "verdict": "While Empire of the Ants’s nearly photo-realistic world looks incredible at first glance, its boring and annoying real-time strategy campaign is the ant-ithesis of that. Combat missions are mostly trivially easy because the AI doesn’t seem to understand crucial mechanics, and those that aren’t are obnoxious because you can’t save mid-mission to replay the tough parts without trudging through the easy setup; Meanwhile, all of the non-combat missions are tedious searches for needles in haystacks and the story fails to make ant politics intriguing. It’s easily the worst single-player campaign I’ve played in years."
  },
  {
    "name": "Planet Coaster 2",
    "score": "8",
    "url": "https://www.ign.com/articles/planet-coaster-2-review",
    "verdict": "Planet Coaster 2 is even better at all of the things its predecessor was good at. It's a detailer's dream, with a colossal variety of rides, scenery, terrain tools, and sometimes terrifyingly vast options for customization. It's also bad at more or less all of the things the last one was bad at, though, as it still fails to make the financial side of running a park, or even staff management, challenging or enjoyable. But the addition of water attractions alone is enough reason to dive in even if you have hundreds of hours sunk into the first Planet Coaster. All told, it's the best sim of its type your money can buy."
  },
  {
    "name": "Metal Slug Tactics",
    "score": "8",
    "url": "https://www.ign.com/articles/metal-slug-tactics-review",
    "verdict": "From its lively, cartoonish sprites to its energetic soundtrack, Metal Slug Tactics is a meticulously crafted ode to the arcade classic that never gets lost blindly chasing its adoration for the series without understanding what makes Metal Slug great. Instead, it introduces a handful of distinct innovations to the tactics genre that masterfully meld Metal Slug’s action-packed platforming and shooting onto a tactics grid. Even though it’s hampered by some frustrating bugs, I’m still having plenty of fun with each run as I experiment with new strategies and team compositions."
  },
  {
    "name": "Slitterhead",
    "score": "5",
    "url": "https://www.ign.com/articles/slitterhead-review",
    "verdict": "Slitterhead features some interesting body-swapping exploration and a unique blood-based battle system, but it never fully capitalises on either of them due to its small handful of repeated level settings and largely indistinguishable enemy encounters. Its story is disappointingly primitive in its presentation, and its time-looping structure only really serves as a feeble attempt to mask the fact that it takes about one hour’s worth of story mission ideas and repeats them incessantly across its 13-hour duration. Like a bloody blade worn down by a few too many battles, Slitterhead grows increasingly dull over time and ultimately just doesn’t cut it."
  },
  {
    "name": "Call of Duty: Black Ops 6 Zombies",
    "score": "8",
    "url": "https://www.ign.com/articles/call-of-duty-black-ops-6-zombies-review",
    "verdict": "I can sum up Black Ops 6’s Zombies mode with a quote from one of the guys I was playing with: “I don’t think I have the right sniper rifle, because enemies aren’t exploding.” He wasn’t being figurative; there’s a sniper rifle that, when upgraded, literally shoots grenades. There are spider monsters that explode from the corpses of dead zombies and hordes so big that, if you’re not careful, they will kill your whole team before one of you can say “please revive me, I have a raygun.” It is absurd and campy and amazing and goofy in all the right ways, and when you clear a map for the first time, that monumental task will have you feeling equal parts exhausted and triumphant. I’m so happy round-based gameplay is back after our brief detour last year, and I love that we have two interesting maps to choose from. There are some annoyances here in terms of bugs, but that hasn’t made me want to stop playing. In fact, I think I’ll hop back into Terminus tonight. There are a couple more Easter Eggs I wanna track down. And who knows? Maybe, eventually, I’ll play the rest of Black Ops 6. But right now, I’ve got zombies to kill."
  },
  {
    "name": "No More Room in Hell 2 Early Access",
    "score": "5",
    "url": "https://www.ign.com/articles/no-more-room-in-hell-2-review-early-access",
    "verdict": "If you pull back the layers of performance issues and bugs, No More Room in Hell 2 has a lot of potential. It plays around with clever ideas about how to get players to work together through some excellent level design, but those concepts aren’t explored enough yet to make it more than just another co-op survival horror shooter with generic guns and scarce loot. No More Room in Hell 2’s Early Access launch at least allows you to team up with friends for a few chaotic and sometimes fun rounds, but with a single available map that gets repetitive fast and a mountain of serious bugs that cause unexpected problems, it needs a lot more time in the oven. With a slew of hotfixes already arriving and more supposedly on the way, hopefully the flames of hell are hot enough to cook it to perfection down the line, but you should probably wait until they do."
  },
  {
    "name": "Call of Duty: Black Ops 6 Multiplayer",
    "score": "8",
    "url": "https://www.ign.com/articles/call-of-duty-black-ops-6-multiplayer-review",
    "verdict": "With Black Ops 6, Treyarch and Raven Software have taken almost everything I love about the Call of Duty multiplayer experience and given it a beautiful polish. The maps are excellent, built to please almost everyone's favorite gun styles. The meat and potatoes – moving quick and dishing out firepower – is aces this year; it's fast without feeling too twitchy, and the weapons dispatch your opponents in exactly the way you expect them to. The Omnimove system is fun and flashy, which makes for some great highlights but doesn’t completely take over as the best technique for every situation. I do wish there were more new and innovative modes to explore, but that’s about the only thing I feel draws fire other than the initial lack of goofy skins available. Overall, Call of Duty: Black Ops 6 shines because although it plays a lot of things safe, it does the fundamentals of multiplayer combat in a way that feels better than it has in a long time. I am having an absolutely awesome time with it."
  },
  {
    "name": "Life is Strange: Double Exposure",
    "score": "9",
    "url": "https://www.ign.com/articles/life-is-strange-double-exposure-review",
    "verdict": "After several attempts to recapture what made the original Life is Strange so enduring, developer Deck Nine Games really knocked it out of the park with Life is Strange: Double Exposure. This is a worthy sequel to a game that captured the hearts and minds of millions of people way back in 2015, myself included. The writing is great, the music is excellent, the cinematography and acting are top-notch, and Max’s new powers are a fun and intuitive fit for its murder mystery structure."
  },
  {
    "name": "Dragon Age: The Veilguard",
    "score": "9",
    "url": "https://www.ign.com/articles/dragon-age-the-veilguard-review",
    "verdict": "Dragon Age: The Veilguard refreshes and reinvigorates a storied series that stumbled through its middle years, and leaves no doubt that it deserves its place in the RPG pantheon. The next Mass Effect is going to have a very tough act to follow, which is not something I ever imagined I'd be saying before I got swept away on this adventure. Enjoyable action combat, a fantastic cast of allies with sweeping story arcs all their own, top-notch cinematics, and moving, nuanced character writing are the wings on which this triumphant dragon soars, pulling out all the stops in a whirlwind tour of Northern Thedas and capping it with a terrific finale that’s built on memorably tough choices and consequences. If we never get another Dragon Age, at least it got to go out on a high note."
  },
  {
    "name": "Call of Duty: Black Ops 6 Campaign",
    "score": "9",
    "url": "https://www.ign.com/articles/call-of-duty-black-ops-6-campaign-review",
    "verdict": "An excellent string of missions that offer variety and flexibility come together to make the best Call of Duty campaign in many, many years. Black Ops 6 is a fantastic return to form for the series, allowing the designers at Raven to delve deep into their bag of tricks and keep you guessing at every turn. It successfully makes each chapter distinct from one another, whilst maintaining a strong level of quality across the board. Packing a thoroughly engaging story that gets better the longer it goes on, it exceeds expectations regarding level design and creativity, showing that when given the time to craft them properly, CoD campaigns still have what it takes to be up there with the best first-person shooters."
  },
  {
    "name": "Teenage Mutant Ninja Turtles: Mutants Unleashed",
    "score": "5",
    "url": "https://www.ign.com/articles/teenage-mutant-ninja-turtles-mutants-unleashed-review",
    "verdict": "Teenage Mutant Ninja Turtles: Mutants Unleashed certainly looks the part, coming admirably close to emulating the scrawled, asymmetrical look of the acclaimed 2023 animated film it functions as a sequel to. It also sounds the part thanks to some genuinely impressive voice acting (although shelling out for some of the ’90s hip hop that gave the movie its own aural edge clearly wasn’t within the budget). However, despite a visible effort to make Mutants Unleashed a lengthy and credible follow-up story to the film, its simple button bashing action quickly becomes boring thanks to its slim selection of enemies and its constantly reused levels. Trying to do too much with too little means it all just becomes rather… vanilla, and that’s a shell of a loaded word to use around the green machine, who rock the town without being seen."
  },
  {
    "name": "Mass Effect: The Board Game",
    "score": "8",
    "url": "https://www.ign.com/articles/mass-effect-the-board-game-priority-hagalaz-review",
    "verdict": "Mass Effect: The Board Game - Priority: Hagalaz does a good job adapting the personalities and gameplay of Bioware’s legendary space epic while offering some fun twists to the formula to make it work with this new cardboard medium. While it doesn’t land every shot it takes, it lands enough to make it a worthwhile time for fans of the source material and also campaign-style board game aficionados or newcomers alike. The system is sound and ripe for new modules and expansions with new characters and missions. I would love a more dedicated skirmish map or pack that offers a bunch of maps that are good to fight enemies on and forgo the whole narrative aspect. Until then, I will dream about flying around space in the Normandy and rolling dice with my bros, Garrus and Wrex."
  },
  {
    "name": "Alan Wake",
    "score": "8",
    "url": "https://www.ign.com/articles/alan-wake-ii-the-lake-house-dlc-review",
    "verdict": "The Lake House DLC is another spectacular and spooky slice of Alan Wake II action. It introduces some fantastic new supporting characters to the Remedy Connected Universe, as well as a terrifying new enemy type to overcome and some wonderfully eerie environments to explore. The challenge of its puzzles may be light, but its combat is still chillingly dark even despite the fact it’s not hugely different from that of the main game, and scouring for the many notes, videos, and audio recordings littered throughout its fear-inducing facility made for a genuinely gripping investigation. Funny, frightening, and full of surprises, The Lake House DLC is a tightly paced slice of psychological horror that serves as an absorbing addendum to Alan Wake II."
  },
  {
    "name": "Kong: Survivor Instinct",
    "score": "5",
    "url": "https://www.ign.com/articles/kong-survivor-instinct-review",
    "verdict": "Setting a Metroidvania-style platforming adventure against a backdrop of building-razing beasts is certainly an intriguing idea, but unlike its towering cast of kaiju cameos, Kong: Survivor Instinct itself simply doesn’t measure up. Its story and characters are underwritten, its ravaged urban playground is eye-catching but not particularly surprising to explore, and its combat fails to evolve enough to keep the fights interesting over the course of the journey. The occasional room-rocking escape sequences do literally shake things up, but they’re few and far between and only distract from the otherwise uncomplicated platforming for short bursts at a time. Kong and his kind may hail from an alternate world hidden deep inside the Earth’s core, but the actual gameplay of Kong: Survivor Instinct is strictly one-dimensional."
  },
  {
    "name": "A Quiet Place: The Road Ahead",
    "score": "7",
    "url": "https://www.ign.com/articles/a-quiet-place-the-road-ahead-review",
    "verdict": "A Quiet Place: The Road Ahead does a commendable job of taking the uniquely silent scary movie series and spinning it into an interactive adventure, even if its methods for sustaining stress seem a bit too clearly contrived at times. I greatly appreciated the many handcrafted human touches that made its evacuated spaces so evocative, and the safety net of its consistent auto-save meant that my numerous instant deaths never became a source of frustration. However, although it may maintain a regularly tense atmosphere every shuffled step of the way, the absence of any significant story surprises or enough substantial changes to its simplistic stealth-based gameplay means that A Quiet Place: The Road Ahead doesn’t quite have enough twists and turns to make for an unmissable journey."
  },
  {
    "name": "Sonic X Shadow Generations",
    "score": "9",
    "url": "https://www.ign.com/articles/sonic-x-shadow-generations-review",
    "verdict": "Sonic X Shadow Generations takes an already excellent game and spring jumps it to new heights at a blistering pace by doubling up the campaign length with creative level design, fantastic bosses, plenty of collectibles, and an appreciable graphical upgrade. While the brand-new Shadow content isn't necessarily long on its own, it adds a nice change of pace to the collection of all-time great Sonic stages Generations already contained, and there’s an exciting new story that’s filled in as you explore the overworld for collectibles, activities, and challenges. This bulked-up remaster soars far and above previous enhanced versions we've gotten in the Sonic franchise, and hopefully will be the gold standard Sega holds itself to when it decides to bring back other Sonic games from the past."
  },
  {
    "name": "Starship Troopers: Extermination",
    "score": "6",
    "url": "https://www.ign.com/articles/starship-troopers-extermination-full-launch-review",
    "verdict": "In the Space Imperialist vs Alien war for your attention, Starship Troopers: Extermination brings a knife to a nuke fight. It’s a shooter you and some friends can find fun in, especially in its tough Horde mode using its simple-yet-distinct classes that help focus the overall large-scale bug-blasting vision. But you’re doing so in spite of how long it takes to unlock all the more interesting gear and abilities those classes have in store, how uncoordinated some of the multiplayer modes are, how downright bad the single-player campaign is, how barren the handful of available maps feel, and the lack of biodiversity in the bug swarm. It’s a serviceable battle that can get frantic in the thick of it, but there are far more noble causes to give your virtual lives for in 2024 than this."
  },
  {
    "name": "Unknown 9: Awakening",
    "score": "5",
    "url": "https://www.ign.com/articles/unknown-9-awakening-review",
    "verdict": "Unknown 9: Awakening is the kind of routine action-adventure game that probably wouldn't blow me away even if it was executed well – and the fact that it isn’t just makes the whole thing fall completely flat. Everything from the formulaic story to the shallow and dull combat and stealth are well below the standard set by genre peers, and the consistently disheveled performance and bugs don’t do Awakening any favors. There’s at least some fun to be had in its interesting reality-bending powers, especially the mind-controlling abilities that let you briefly play as your foes and sabotage the enemy in clever ways, but these bright spots run their course quickly, leaving us with a wholly underwhelming adventure."
  },
  {
    "name": "MechWarrior 5: Clans",
    "score": "8",
    "url": "https://www.ign.com/articles/mechwarrior-5-clans-review",
    "verdict": "MechWarrior 5: Clans surprised me with its excellent campaign, carried by a thoughtful, well-told story, great mission design, fantastic walking-tank combat, and all of the customization you could want. I genuinely loved playing Clans, especially in co-op, and several story moments and missions will stick with me for a long, long time because of the way they simultaneously made me consider the ethical questions of war while grouping my rockets and lasers to obliterate a target and turning my damaged armor out of harm’s way. I just wish my first playthrough hadn’t been so buggy, especially in co-op. If Piranha’s promised post-launch patches can fix its issues, Clans will have a lot fewer frustrating lows to drag down its many impressive highs – but one way or another, I’ll definitely be suiting up for the Smoke Jaguar Clan for another run in the future."
  },
  {
    "name": "Dragon Ball: Sparking! Zero",
    "score": "7",
    "url": "https://www.ign.com/articles/dragon-ball-sparking-zero-review",
    "verdict": "Dragon Ball: Sparking! Zero is a final flash from the past, sometimes to a fault, as demonstrated by its archaic menus and remedial training tools. Its Episode Battles have the kind of reaction-heavy difficulty that doesn’t really exist in most games these days, more than once crossing the line between challenging and frustrating. But the feeling of traveling back to a simpler time when games didn’t have to be balanced or competitive to be fun is a good one, especially when that action stays so true to that of the show it’s recreating. Reliving a story that was foundational to my youth, looking and sounding as great as I remember it, with the opportunity to alter it in sometimes dramatic new ways is clever, and the addition of tools to attempt to create our own stories could elevate the experiment even further if a community can figure out how to make the most of them."
  },
  {
    "name": "Until Dawn",
    "score": "5",
    "url": "https://www.ign.com/articles/until-dawn-2024-review",
    "verdict": "This remade version of Until Dawn features a substantial visual upgrade that bring it in line with some of the best-looking horror adventures on the PlayStation 5, and Supermassive’s definitive horror story is just as gory and schlocky as it’s ever been. However, its cinematic flair is slightly undermined by the new over-the-shoulder camera, and it suffers at the hands of a frame rate that’s choppier than even the most caffeinated of axe murderers. Movement is noticeably slower and more sluggish than it used to be, and the handful of new gameplay features – like the pointless totem-turning mini-game – are unwelcome and don’t even come close to justifying this remake’s premium price tag especially when the original is sitting right there next to it in the store. Never mind the eight potential victims to be found inside its cabin in the woods, if you’re still determined to play this half-hearted horror remake you should at least wait until it’s the price that is slashed instead."
  },
  {
    "name": "Metaphor: ReFantazio",
    "score": "9",
    "url": "https://www.ign.com/articles/metaphor-refantazio-review",
    "verdict": "There’s a certain familiarity in Metaphor: ReFantazio, but Atlus takes the principles of its already excellent RPGs and refines them in a way that effortlessly ushers you through its brutal, and sometimes beautiful, new fantasy world. The Archetype system and all the new wrinkles it added to the turn-based battles build upon a strong foundation, and the social elements are streamlined to better deliver the most important aspects of the stories they tell. The sense of adventure you get from traveling across the kingdom and the powerful sense of purpose you have to do so drive its memorable journey, distinguishing itself from those that came before it. When I finally closed the book on Metaphor after 80 hours, I felt a unique warmth in its message, because it’s driven by the ideals of a just society smartly contextualized in a unique metanarrative. Metaphor: ReFantazio is poetic, and at times, idealistic, but it also understands its complexities and that change requires action, and that even far-fetched fantasy stories can serve as inspiration to make our world a better place."
  },
  {
    "name": "Undisputed",
    "score": "6",
    "url": "https://www.ign.com/articles/undisputed-review",
    "verdict": "Developer Steel City Interactive's approach to boxing in Undisputed is on the right track, but there’s a long road ahead of it. Its emphasis on realism, preparing for fights using RPG-like mechanics, and creating an adrenaline-filled experience in the ring are significant building blocks. Still, the fluidity of its gameplay animations and reactiveness of its commentators don’t come close to living up to the high bar that was set by the Fight Night series back in the late 2000s, and its realistic fighting can be a little dull if you’re in the mood for a KO instead of a TKO. Still, it serves as a decent meal for an otherwise-starved genre, and that’s a lot better than we’ve had in the last decade."
  },
  {
    "name": "Diablo 4: Vessel of Hatred",
    "score": "8",
    "url": "https://www.ign.com/articles/diablo-4-vessel-of-hatred-review",
    "verdict": "Diablo 4: Vessel of Hatred is an awesome expansion that adds an excellent new area to explore, a gloriously modular character class that I can’t stop playing, an impressive debut raid activity, and lots more. But while just about everything it adds is awesome, it definitely doesn’t do enough where the somewhat flaccid campaign and story is concerned, and numerous bugs can occasionally drag it down. Thankfully, the changes to the meta, a greatly improved progression system, the resurrection of rune words, and NPC companions are all major wins for Diablo 4, even when it seems we’ll be waiting a bit to see where this interlude expansion leads."
  },
  {
    "name": "SpongeBob SquarePants: The Patrick Star Game",
    "score": "5",
    "url": "https://www.ign.com/articles/spongebob-squarepants-the-patrick-star-game-review",
    "verdict": "SpongeBob SquarePants: The Patrick Star Game is obviously geared more towards kids than those of us who grew up loving SpongeBob, but so are things like Astro Bot and Super Mario Wonder, and those games are brilliant. By contrast, the lack of exciting puzzle solutions or meaningful challenges offered across this six-hour adventure is bad enough that it feels like an underestimation of that audience. Propped up by the iconic and playful world of Bikini Bottom, it makes a strong first impression that quickly wears thin. Its physics-heavy sandbox can briefly be a joy to explore if you’re a fan of the TV series, however the slew of monotonous minigames and host of on-loop conversations within it fail to fully capture that show's spirit. Without an engaging goal or overarching story to latch onto, the end result is a repetitive and uninventive adventure that does a disservice to Patrick’s protagonist potential."
  },
  {
    "name": "Silent Hill 2",
    "score": "8",
    "url": "https://www.ign.com/articles/silent-hill-2-2024-review",
    "verdict": "Silent Hill 2 is a welcome modernisation of a survival horror masterpiece. It smoothly polishes down the rough edges of the original game’s combat while taking a piece of heavy grit sandpaper to scuff up every rust and mold-covered surface of its nightmarish environments, successfully making them appear far more abrasive and menacing to explore. Previously primitive boss battles have been transformed into substantially more intense encounters, and its intimidating audio design kept me acutely aware that every fog-cloaked street I walked down could quickly hurry me towards my own dead end. It does feel a little padded out in parts, and I do wish that Bloober Team had streamlined some of its more convoluted puzzle sections to prevent the story’s momentum from sagging on occasion. Still, intermittent pacing problems aside, Silent Hill 2 is a great way to visit – or revisit – one of the most dread-inducing destinations in the history of survival horror."
  },
  {
    "name": "Starfield: Shattered Space",
    "score": "7",
    "url": "https://www.ign.com/articles/starfield-shattered-space-review",
    "verdict": "Starfield: Shattered Space fills the conspicuous Va’ruun-shaped hole in the main campaign with a generous helping of quest content that’s thick with snake-worshiping lore and tough, teleporting enemies. Elder Scrolls and Fallout fans will recognize a lot of these story outlines, but the Starfield twist makes them more than simple reheats. Refreshingly, the new planet is more of a traditional Bethesda-style open world that feels more like a real place where there’s a lot to do, which is a welcome improvement over hopping between mostly barren worlds. However, there’s not much to take with you once you leave, since outside of new quests and a handful of new weapons and building options there are no new gameplay systems – or even new powers or skills – you’ll want to try out after a new run through the Unity. It’s more Starfield for those who want it, but Shattered Space doesn’t shatter a lot of conventions."
  },
  {
    "name": "Ara: History Untold",
    "score": "6",
    "url": "https://www.ign.com/articles/ara-history-untold-review",
    "verdict": "While Ara: History Untold is a visually captivating historical 4X with an interesting underlying economy, it gets bogged down well before the midway point, mainly because it doesn’t provide enough tools and UI support to manage all of the things it expects you to manage. Your choice of leader, religion, and government almost always simply add uninteresting passive modifiers, which means most playthroughs will feel roughly the same other than the layout of the map itself. I had a pretty decent time with my march through the ages, especially in the first of its three acts. But it did require me to eventually give up on trying to play optimally, passing turns without doing anything until I emerged victorious. A lot of these systems are exciting and clever in their design – they're just not that enjoyable to interact with past a certain point."
  },
  {
    "name": "Dead Rising Deluxe Remaster",
    "score": "8",
    "url": "https://www.ign.com/articles/dead-rising-deluxe-remaster-review",
    "verdict": "Above all, Dead Rising Deluxe Remaster preserves the iconic original’s experience while including some very logical and welcome modern adjustments, like auto-saving, a new navigation system, and NPCs that seem less inclined to serve themselves for lunch. Not all the new voice acting is an improvement – and there are a variety of other tedious flaws that have gone unfixed – but wading back into the Willamette Parkview Mall after all these years has been an effective reminder of just how brilliant the original Dead Rising was back in 2006. Coaxing as many hapless consumers as I can back through throngs of the festering undead is as compulsive as it was nearly two decades ago. At the very least, now that I’ve paused to actually package this review together, it’s still gnawing at me to return – and that’s the sign of any great game (or reasonably effective zombie, for that matter)."
  },
  {
    "name": "Tiny Glade",
    "score": "7",
    "url": "https://www.ign.com/articles/tiny-glade-review",
    "verdict": "Good things come in small packages, and Tiny Glade is no exception. The gameplay might be limited – or even nonexistent, depending on your definition – but treat it as a toy set and the time you lose to creating villages full of duck ponds and flower gardens won't be. It could certainly use more content and flexibility to dive deeper into, but the way you can quickly and easily create a natural-looking structure using its satisfying procedural building tools got more out of what it has than I expected. Learn to live with the lack of actual objectives, enemies, or natural disasters, and you'll be rewarded with a flow state that borders on a trance and a set of screenshots that will make you huge on #cottagecore TikTok."
  },
  {
    "name": "Satisfactory",
    "score": "9",
    "url": "https://www.ign.com/articles/satisfactory-review",
    "verdict": "Satisfactory is the best automation game ever made and I seriously can’t recommend it enough. Every moment of the over 130 hours it took to build messy conveyor belt disasters and delightfully efficient factories was engaging, ridiculous, and an absolute blast with friends. Exploring this gorgeous, bespoke world in search of secrets and resources serves as a fantastic change of pace from constructing assembly lines, even when combat doesn’t offer much more than a few generic aliens to shoot at while doing so. It’s a drag thatSatisfactory’s insatiable appetite for electronics also results in regular technical annoyances, but none of them come close to souring this stellar factory builder."
  },
  {
    "name": "Frostpunk 2",
    "score": "8",
    "url": "https://www.ign.com/articles/frostpunk-2-review",
    "verdict": "Building up multiple colonies, researching technologies, and passing laws in Frostpunk 2 is quite the act of plate-spinning. Just about anything you do is bound to make one of your city’s factions angry at you, and a powerful storm can literally and figuratively freeze your whole economy. This is a city-building sequel that might have lost some of the intimacy of the original by thinking bigger, but what it’s gained through its ambitious philosophy of reinvention rather than iteration means you can play it immediately after the original and not feel like you’ve done most of this before."
  },
  {
    "name": "The Plucky Squire",
    "score": "7",
    "url": "https://www.ign.com/articles/the-plucky-squire-review",
    "verdict": "At its heights, The Plucky Squire is a beautiful Zelda-inspired adventure filled with brilliant wordplay-packed puzzles. Jot’s ability to manipulate his own storybook from both the outside and within result in clever dimension-hopping mechanics and solutions that make each problem a joy to unpack. While genuinely funny at times, its wordy script often gets in the way of the action and occasionally spoils a puzzle’s solution before it even begins. It also drags in its drawn-out final act, as the adventure continues a couple hours after it’s already used up all its best ideas. But prior to that late stumble, The Plucky Squire is full of surprises, breaking up its puzzles with cute minigame homages to classic video game genres and fun sections that take Jot outside of the pages of his story."
  },
  {
    "name": "Harry Potter: Quidditch Champions",
    "score": "6",
    "url": "https://www.ign.com/articles/harry-potter-quidditch-champions-review",
    "verdict": "When you’re flying around the pitch, Harry Potter: Quidditch Champions can be a blast. Each position has a lot of depth to it, whether you’re harassing the other team’s Seeker as a Beater, drifting to keep up with the Snitch as a Seeker, faking out a Keeper to score as a Chaser, or making the perfect save yourself. Quidditch Champions makes smart rule changes to make this fantasy sport more fun while capturing the look and feel of the Wizarding World. There just isn’t much here off the pitch to keep you playing long-term, and co-op progression issues mean you can’t easily take on its career mode tournaments or grow your collection of unlockables with friends. Quidditch Champions did the near-impossible by turning quidditch into an actual competitive game, but I just wish there was a little more bristle on the end of this broom."
  },
  {
    "name": "Test Drive Unlimited Solar Crown",
    "score": "5",
    "url": "https://www.ign.com/articles/test-drive-unlimited-solar-crown-review",
    "verdict": "Test Drive Unlimited Solar Crown is far and away the most ambitious driving game that developer KT Racing has ever put together, but it’s plagued with problems. Forced online requirements that feel needlessly punitive towards solo players, inconsistent and non-adjustable AI difficulty levels, a stale car list, and chore-like progression all conspire to undermine an otherwise robust driving model and eye-catching open world. The former home of the WRC series has come out swinging with Solar Crown, but unfortunately the studio may have flown a little too close to the sun."
  },
  {
    "name": "Persona 3 Reload: Episode Aigis",
    "score": "8",
    "url": "https://www.ign.com/articles/persona-3-reload-episode-aigis-the-answer-dlc-review",
    "verdict": "Episode Aigis: The Answer may not be the most exciting gameplay experience to come from an Atlus RPG, but its story is a crucial piece to Persona 3’s full picture. In its strongest moments, The Answer finds new ways to be just as powerful by understanding the pain that comes from heartbreak and loss in all its complexities, and how that changes a person. With its premise, it expresses the tedium of feeling stuck reliving the same day over and over again, but it’s also a moving statement about how we break out of grief’s vicious cycle and push forward. I always found The Answer to be thematically affecting, and having it repackaged for Reload means it’s no longer isolated as a dated PS2 game – and if anything, it’s a bittersweet epilogue to the series’ best story."
  },
  {
    "name": "World of Warcraft: The War Within",
    "score": "9",
    "url": "https://www.ign.com/articles/world-of-warcraft-the-war-within-review",
    "verdict": "The War Within is the best World of Warcraft has been on all fronts in many years, and possibly ever. When returning franchise creative director Chris Metzen got on stage at BlizzCon and said it was time to come home, he really wasn't just stringing us along. The writing is strong. The gameplay is strong. The music and zone design are exceptional even by Blizzard standards. The endgame loop feels good and offers tons of satisfying ways to progress, including more appropriately difficult and rewarding solo content than ever. The level 80 experience has some wonky tuning and annoying bugs, but I trust Blizzard to get that ironed out in due time. Somehow, this two-decade-old MMO feels fresh and thrilling again."
  },
  {
    "name": "Funko Fusion",
    "score": "4",
    "url": "https://www.ign.com/articles/funko-fusion-review",
    "verdict": "Funko Fusion has no shortage of oversized heads, but between them all it still manages to contain precious little in the way of interesting new ideas. Its simplistic shooting is dull, its many bugs and backtracking requirements are exhausting, and its peculiar marriage of child-pleasing character styles and LEGO-like level design with a number of film and television licenses that are distinctly adult just seems ill-advised from the jump. Although it definitely nails the signature look of the pint-sized collectibles, it’s just not much fun to play which means that just like your Funko Pop collection it’s probably best left on the shelf."
  },
  {
    "name": "Enotria: The Last Song",
    "score": "7",
    "url": "https://www.ign.com/articles/enotria-the-last-song-review",
    "verdict": "Aside from the fundamentals of combat, Enotria: The Last Song really tries to step outside of the box when it comes to dressing up the standard soulslike. The sun-drenched environments and wild, Italian folklore-inspired character designs are a real breath of fresh air straight from Italy’s Alps. Combat is fun, even when the difficulty spikes unexpectedly (since most of those fights are optional anyway) and despite the bloat of many, many systems that govern all of the more nuanced abilities and stats. The unapproachability of its RPG systems, and the wonky performance when a smooth frame rate matters the most are what really prevent Enotria from taking center stage."
  },
  {
    "name": "Fortnite Re",
    "score": "9",
    "url": "https://www.ign.com/articles/fortnite-review-2024",
    "verdict": "No matter which version of Fortnite’s battle royale shooter you prefer, Epic Games makes sure that there’s always something on the horizon waiting for you, both in or out of a match. Whether it’s the enticing glow and heavenly hum of a treasure chest full of loot, the faraway glint of an opponent’s sniper scope on a ridge, a sports car in your favorite color, or an exciting quest to complete, you’d have to try to get bored while playing. And by throwing everything it has at you in updates, chapter after chapter and season after season, Epic’s dedication and support have made Fortnite one of the best-maintained ongoing multiplayer games out there. Even when a new weapon, vehicle, location, or event occasionally feels like a dud, there’s usually something great around the corner to even it out. It’s rare to see a game on this scale constantly experiment, take risks, and have so much fun with itself. And while its goofy, over-the-top crossovers with beloved games, movies, TV shows, and more often bring a whiff of corporate synergy with them, it’s undeniably cool to squad up with friends as your favorite characters and compete for that sweet Victory Royale."
  },
  {
    "name": "I Am Your Beast",
    "score": "7",
    "url": "https://www.ign.com/articles/i-am-your-beast-review",
    "verdict": "I Am Your Beast is a stirring, snack-sized shoot ‘em up that succeeds in spite of its simplified story and slightly punitive progression. Its supremely responsive controls and readily available arsenal of pick-up-and-slay weapons made me feel like a one-man army unleashed on groups of unsuspecting enemies, while its strict time-based goals and bonus objectives gave me reason to return to most of its levels to continually refine my approach. It may lack a truly unique hook to put it head and shoulders above the pack, but I Am Your Beast was still furious enough to sink its claws into me and keep me gripped to it throughout its short stay."
  },
  {
    "name": "Warhammer 40,000: Space Marine 2",
    "score": "8",
    "url": "https://www.ign.com/articles/warhammer-40000-space-marine-2-review",
    "verdict": "Warhammer 40,000: Space Marine 2 is a terrific third-person shooter with a compelling story, loads of weapons that are a blast to use, and a healthy variety of enemies to use them on. It once again borrows many of its ideas from the Gears of War series, but they’re good ideas, and Space Marine 2 does a fine job of making them its own. And while the Operations PvE mode that accompanies it doesn’t currently offer enough to keep me coming back, the deep customization options for your Space Marine do look promising if it’s supported in post-launch updates as planned. Besides, when you’re eviscerating aliens on planets as pretty as these, it’s hard not to leave satisfied."
  },
  {
    "name": "The Casting of Frank Stone",
    "score": "5",
    "url": "https://www.ign.com/articles/the-casting-of-frank-stone-review",
    "verdict": "The Casting of Frank Stone’s repetitive, time-hopping horror tale is packed with dozens of character choices to consider, but really the most important decision that Dead by Daylight fans need to make is whether or not a sub-standard, six-hour story is worth sitting through purely to spot the odd recognisable weapon or slight reference to the source material’s lore. I would argue it’s not, since no single stretch of this sluggish and forgettable horror show ever comes close to matching the frantic amounts of fun to be had in a single, 15-minute Dead by Daylight trial. Unable to match the intensity of its murderous multiplayer inspiration and lagging well behind Until Dawn and The Quarry as a standalone story, The Casting of Frank Stone is a second-rate interactive slasher that just can’t hack it."
  },
  {
    "name": "Squirrel with a Gun",
    "score": "6",
    "url": "https://www.ign.com/articles/squirrel-with-a-gun-review",
    "verdict": "Squirrel with a Gun is an awesome, immediately charming idea with legs as short as its fluffy protagonist. While platforming around by firing off weapons and causing mayhem in the small sandbox areas yields plenty of enjoyable moments, shallow combat, numerous technical issues, and short runtime left me wanting more. Even the over-the-top boss fights, which are definitely a high point in the zany adventure, come to an end all too quickly and are in short supply. I still adore this violent rodent and have high hopes for a sequel that’s bigger, more fleshed out, and less prone to crashing, but this first shot leaves a fair bit to be desired."
  },
  {
    "name": "Concord",
    "score": "7",
    "url": "https://www.ign.com/articles/concord-review",
    "verdict": "Concord isn’t the most innovative or content-heavy hero shooter you could play, but with such fantastic competitive gameplay, 16 compelling characters to master, and 12 well-designed maps, it’s got the makings of something that could go the distance in the months and years to come. In fact, it’s a testament to its FPS chops that even while it has a virtually nonexistent story and a serious need for a signature game mode, I still found myself losing dozens of hours to its PvP charms. Hopefully the live-service roadmap will do its thing and show this promising shooter the love it needs to become something truly special, but right now it’s at least good enough for me to recommend trying out."
  },
  {
    "name": "Visions of Mana",
    "score": "8",
    "url": "https://www.ign.com/articles/visions-of-mana-review",
    "verdict": "Visions of Mana finally brings the long-dormant classic RPG series into the modern age, looking great and playing even better thanks to multi-layered class and skill systems that interact in clever ways. There are definitely some pacing issues and a few questionable design choices later on, and the occasional framerate drop or awkward lipsyncing can distract. But the flashy and exciting combat, deeply rewarding class system, and cast of likable characters make Visions of Mana a winning comeback for the classic series all the same – and a great game even if you haven’t spent decades waiting for it."
  },
  {
    "name": "Monster Jam Showdown",
    "score": "7",
    "url": "https://www.ign.com/articles/monster-jam-showdown-review",
    "verdict": "Monster Jam Showdown distinguishes itself from the last two decades of officially licensed Monster Jam games by actually delivering a decent, if modest, serving of monster truck mayhem. It’s a great looking, family-friendly racer that feels good to fling over giant jumps, but it’s light on track variety and crying out for a deeper career mode and customisation."
  },
  {
    "name": "Star Wars Outlaws",
    "score": "7",
    "url": "https://www.ign.com/articles/star-wars-outlaws-review",
    "verdict": "It’s ironic that Kay’s ship is called the Trailblazer, since there’s actually not a whole lot of ideas in Star Wars Outlaws that haven’t been done before in other action and open-world adventures. Instead, it’s quite like the Millenium Falcon: a bucket of bolts held together with repurposed parts and prone to breaking down, but at its best it’s more than capable of jolting your pleasure centres into Star Wars fan hyperspace. A clever syndicate system brings real weight to almost every task you choose to undertake, some of which have creative quest designs that can often conjure up some genuinely stunning blindsides. Having a pal like Nix at your side the entire time not only adds an extra dimension to Kay’s fairly generic smuggler character, but also gives her an enhanced set of useful abilities. But even he can’t quite make its stealth and combat feel any less rigid and repetitive, and the odds of avoiding the many glaring technical issues present at launch are 3,720 to one. But you probably didn’t want me to tell you the odds."
  },
  {
    "name": "Tactical Breach Wizards",
    "score": "8",
    "url": "https://www.ign.com/articles/tactical-breach-wizards-review",
    "verdict": "Tactical Breach Wizards doesn’t demand knowledge from lost magical tomes to conquer its character-focused missions, each of which is filled with lots of doodads to fiddle with and not a lot of space to do it in. Being easy doesn’t mean it isn’t fun though – in fact, the very opposite is true here, thanks to the creative kits on every unit and how dynamic the combinations between them can be. Wrap that up in a vibrant and weird world with some truly incredible writing and it’s hard not to get entranced in its spell."
  },
  {
    "name": "Fallout London",
    "score": "7",
    "url": "https://www.ign.com/articles/fallout-london-review-mod",
    "verdict": "When you consider it’s a completely free mod rather than an official game, Fallout London is extremely impressive. It’s a massive RPG worthy of the Fallout moniker, and the way it uses its titular city to shake up the series’ US-centric formula is extremely effective and refreshingly novel. The twists and turns of the main story are compelling, aside from when you’re sent off on unrelated busywork, and going off the beaten path to adventure with companions is as fun here as it is in any modern open-world Bethesda game. However, installing this mod is a technical undertaking you need to be prepared for, and even when you’re successful it comes with more than its fair share of bugs and crashes. But of course, it’s all worth it: If you have the mettle to overcome those challenges – and the occasional obtuse mission design – there is a lot of fun to be had in Ol’ Blighty."
  },
  {
    "name": "Black Myth: Wukong",
    "score": "8",
    "url": "https://www.ign.com/articles/black-myth-wukong-review-pc",
    "verdict": "As GameScience’s debut action game, Black Myth: Wukong is mostly a great success, despite some major technical black marks and localization issues that are likely to cause some frustrations at launch. Combat is fantastic thanks to a great balance of careful resource management and lightning-fast, twitch-reaction gameplay that tested my skills as much as Elden Ring ever has, despite being a more traditional action game than FromSoftware’s style. Not only that, but there are a ton of exciting boss battles, a great variety of enemies, and the world they inhabit is an absolute treat for the eyes and ears. Its story has its moments but relies a bit too much on having prior knowledge of the events of Journey to the West, and it really could have used a map to make its rewarding exploration measure up to the strength of its combat. That said, its strengths more than carry it through, making Black Myth: Wukong a great action game that could be even greater if GameScience can squash the bugs."
  },
  {
    "name": "Madden",
    "score": "6",
    "url": "https://www.ign.com/articles/madden-nfl-25-review",
    "verdict": "There’s a lot to like in Madden NFL 25. The on-field action is the best it's been and BOOM Tech and the additions from College Football 25 make it a better game than Madden NFL 24. The presentation upgrades are very welcome too, but the modes are functionally the same. Ultimate Team is still a Skinner Box, Superstar is still mediocre, and the Skills Trainer, while great, really needs an update to help newer and lapsed players along. Franchise is the best thing here, and it still needs help. The improvements it did get are nice, but also long overdue, and you don’t get a parade for doing things you should have done years ago. EA seems content to continue skating by on being the only company with the NFL license. Remember that bit about the definition of insanity?"
  },
  {
    "name": "Dustborn",
    "score": "7",
    "url": "https://www.ign.com/articles/dustborn-review",
    "verdict": "After the first hour, I was sure finishing Dustborn would be up there with folding laundry in terms of chores – but just a few hours later and I was invested in the welfare of all my little freaky friends as they played gigs, fought robots, and had sometimes melodramatic conversations. Its band of well-intentioned weirdos tells an absorbing story in an alternate-history America, and while I may have started by rolling my eyes, I was high on science fiction satisfaction and wondering if I was too old to get a neck tattoo and some neon accessories by the end."
  },
  {
    "name": "Stormgate Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/stormgate-review-early-access",
    "verdict": "As a competitive RTS, Stormgate is what's next. Or at least, I hope it is. It pushes that classic basecraft formula forward with a veteran's eye for what works and what doesn't, and gets me pumped to queue up again right after I finish a match – win or lose – in a way I haven't been since the early days of Wings of Liberty. If I were judging it only based on that, it would get high marks already. But the short, low-rent campaign is less than inspiring, leaving one of its major factions entirely without context and retreading very familiar narrative ground. However, it's rounded out with an exciting co-op mode that features some cool heroes and offers a nice entry point to anyone who doesn't want to leap straight into the jaws of 1v1 matchmaking. For Early Access, Stormgate is pretty promising when it lays all its cards on the table. But it still has miles to go."
  },
  {
    "name": "Volgarr the Viking 2",
    "score": "6",
    "url": "https://www.ign.com/articles/volgarr-the-viking-2-review",
    "verdict": "Volgarr the Viking 2 is not a bad game, but it is one that feels at odds with itself. It’s built on a foundation of encouraging you to master the very precise and careful spacing in both its combat and platforming, which starts out quite compelling… but once you use six continues, you’re locked into a mode that throws all of the precision out the window as you become impervious to all damage. And even if it didn’t eventually trivialize itself with the Zombie Volgarr mode, the levels themselves are too long to be suited for that kind of incremental mastery unless you have the patience of a saint or the skill of a speedrunner. Even as someone who generally loves hard-as-nails games, Volgarr the Viking 2 disappointingly crosses the line from satisfying challenge to unfair frustration too often to recommend it."
  },
  {
    "name": "SteamWorld Heist 2",
    "score": "8",
    "url": "https://www.ign.com/articles/steamworld-heist-2-review",
    "verdict": "SteamWorld Heist 2’s charming adventure refines the original game’s clever turn-based combat with a flexible mix-and-match class system and handmade maps that are built around using teamwork to accomplish their objectives and escape unscathed. On top of that, it serves up a light and entertaining real-time nautical exploration game as a palette cleanser between battles, and swapping between them helps things stay fresh for more than twice the first game’s 15-hour length. It’s occasionally mired in grinding to unlock the next area and the skill system will make you waste a lot of XP if you don’t know what’s coming, but there’s no shortage of loot, amusingly off-kilter robot characters, and fantastic original folksy music along the way."
  },
  {
    "name": "The Sims 4 Re",
    "score": "8",
    "url": "https://www.ign.com/articles/the-sims-4-review-2024",
    "verdict": "The Sims 4 is starting to feel its age in 2024, but what keeps it so compelling is that magical feeling that occurs when all its parts work together to create the rich tapestry of your Sims' lives. The complex character creator and approachable building mode are both impressive in their own right – and as personality quirks rub up against the houses you’ve tenderly built, you’re rewarded with hilarious and profound emotional reactions from the beloved families you’re guiding. Romance, friendship, and hatred all play essential roles, and there’s a deeper focus on replicating the complexities of human life than any other game in this genre. Yet despite maintaining the bar for life simulators at large, the last decade has also left the base game with an outdated fashion sense and locked what now feel like core features such as pets behind paid DLC – a problem that can only be escaped by indulging in fan-made mods or costly expansions. Even so, after hundreds of hours of playtime and nearly a decade of history, I’m still always excited to build a new family dynamic and start the chaotic cycle of life all over again."
  },
  {
    "name": "Earth Defense Force 6",
    "score": "7",
    "url": "https://www.ign.com/articles/earth-defense-force-6-review",
    "verdict": "Earth Defense Force 6 is yet another riotous entry in one of the most ridiculous and corny series ever to make very poor use of our fancy gaming hardware. It looks at least a decade out of date, is absolutely dripping with plot holes and awful voice acting, and has some of the silliest combat I’ve seen in a long time – but all of that only works to its credit, coming together as a game I’ve happily lost dozens of hours of my life to while giggling like an idiot. Not all of its rough edges add to its charm, though, and an overly long campaign filled with repetitive levels and some irritating design choices definitely work against it. But those things are pretty easy to forgive when you accidentally blow your friends up with a rocket launcher that sends giant ants sailing into the air and skyscrapers crumbling into rubble."
  },
  {
    "name": "Nobody Wants to Die",
    "score": "7",
    "url": "https://www.ign.com/articles/nobody-wants-to-die-review",
    "verdict": "Nobody Wants to Die’s relatively brief story isn’t a completely original concept, but it has a cool mix of inspirations and unique worldbuilding touches that all work well together to create something new and engaging. There’s a bit too much hand-holding for a game about the art of investigation, but its conversation system picks up the slack with humor, unexpected outcomes, and a surprisingly deep story about how impactful your past can be on your present — even when you’re facing immortality."
  },
  {
    "name": "F1 Manager 2024",
    "score": "8",
    "url": "https://www.ign.com/articles/f1-manager-2024-review",
    "verdict": "F1 Manager 2024 doesn't completely escape the pitfalls that come with being an annual series, though evolutionary changes make this a welcome third outing. New features like creating your own team offer strong customization options, and securing victories with a tailor-made squad feels even sweeter than building upon an existing one. The mechanical faults and expanded sponsorship systems add welcome strategic depth, too. Several flaws like the tedious contracts system and sprint format, could use further work, and some lingering issues like collision damage haven’t been solved, but this is still Frontier's best take on a Formula 1 management sim yet."
  },
  {
    "name": "Flintlock: The Siege of Dawn",
    "score": "7",
    "url": "https://www.ign.com/articles/flintlock-the-siege-of-dawn-review",
    "verdict": "While the early hours are a bit rough, Flintlock: The Siege of Dawn is one of those soulslikes that only gets better as you get further in, unlocking more of the interesting skills that allow you to fully take advantage of its attack chains and XP multipliers. However, you’ll need to want to head off the beaten path to tackle sidequests, find optional fights, or interact with various NPCs to earn weapons and upgrades in order to get the most out of it. Thankfully, Flintlock respects your time while doing so with its use of shortcuts, fast travel, and other ways of making exploring fun and easy. It may have an abridged run time compared to other RPGs, but it makes good use of that time with interesting sidequests and an excellent minigame. Unfortunately, Flintlock’s story meanders a bit towards the middle and wastes a few opportunities that could have let its main characters shine, but this adventure did leave me interested to find out where Nor and Enki will go next."
  },
  {
    "name": "Once Human",
    "score": "8",
    "url": "https://www.ign.com/articles/once-human-review",
    "verdict": "Once Human is a lot of fun, with survival-crafting that is simple and accessible, but still rewarding to dig into. Building a house is amusing, even if pieces aren’t always cooperative about snapping together in the right orientation. And while the combat is generally pretty basic, the grotesque weirdness of the monsters more than makes up for that, especially when you get a menagerie of weird little creatures of your own to fight with. Once Human would benefit from more creative quests and a flatter difficulty curve, but I still had a great time, and I’m eager to continue my adventures in this twisted world as its first season progresses."
  },
  {
    "name": "Kunitsu",
    "score": "8",
    "url": "https://www.ign.com/articles/kunitsu-gami-path-of-the-goddess-review",
    "verdict": "Kunitsu-Gami: Path of the Goddess is an exciting action-strategy hybrid that left me yearning to know more about its inspirations and intricacies. The satisfying day-night structure of its stages evoked that overwhelming “just one more thing” feeling that easily had me losing track of time – and while it could occasionally be tainted by busy work base management deeper in, the overall experience was a delightfully unique one. It’s not the most challenging action game around, but the strategy it demands is still satisfying, and its wide range of interesting enemy designs and quiet but effective storytelling are something I’ll remember for a long while. It’s an odd thought, but I’m glad a game as enigmatic as Kunitsu-Gami exists."
  },
  {
    "name": "Final Fantasy",
    "score": "8",
    "url": "https://www.ign.com/articles/final-fantasy-xiv-dawntrail-review",
    "verdict": "Dawntrail has some growing pains and notable lulls as it establishes a new era for Final Fantasy XIV, but the compelling cultures of the Tural region are strong enough to carry you to its greater moments – it’s also nice to see real-world influences near and dear to me represented so well in FFXIV. And though it takes a bit to get there, once the main story flips the switch and shows you what it’s really about, it hits the kinds of peaks we’ve seen from the MMORPG time and time again. Dawntrail left me floored with a unique sense of self-reflection and stunned by spectacular combat encounters, and to go through that journey with characters I’ve grown to love, both new and old, proves that this experience can only exist in the form that it does. This expansion is a worthy extension of FFXIV, and it leaves a world of fascinating possibilities for the future. Dawntrail doesn’t forget that this is a Final Fantasy story, and the way it ties in its past, present, and future makes for incredible moments that continue to uplift and define the series."
  },
  {
    "name": "The First Descendant",
    "score": "5",
    "url": "https://www.ign.com/articles/the-first-descendant-review",
    "verdict": "The First Descendant has all the building blocks of a fantastic looter shooter, but they’re buried under a pile of monotonous quests, a terrible story, and an infuriating free-to-play model that has influenced its game design in the worst possible way. In its best moments, blasting aliens apart with both fireballs and a satisfying arsenal of weapons makes for a really great time – but at least an equal portion of my time was spent battling perplexing design decisions that tested the limits of my abundant patience. Like its peers, future updates could evolve this live-service into a much more consistently enjoyable way to spend time with friends, but for now it misses the mark too often to make its grind feel worthwhile."
  },
  {
    "name": "Zenless Zone Zero",
    "score": "8",
    "url": "https://www.ign.com/articles/zenless-zone-zero-review",
    "verdict": "By leaning into early 2000s nostalgia and then blending it with a stylish vision for the future, Zenless Zone Zero crafts an inimitable world that is easy to get invested in. Exploring New Eridu and getting to know this charming cast both in and out of combat was a thrilling ride I was keen to keep at for hours on end. It’s not necessarily as deep as many of its gameplay inspirations, and momentum-killing hacking puzzles can sometimes sour the mood slightly – but with exhilarating, approachable combat and so many extracurricular activities to take care of, it was always easy to turn a corner and get swept back up in the captivating culture of Zenless Zone Zero."
  },
  {
    "name": "The Legend of Heroes: Trails through Daybreak",
    "score": "8",
    "url": "https://www.ign.com/articles/the-legend-of-heroes-trails-through-daybreak-review",
    "verdict": "The Legend of Heroes: Trails through Daybreak is an exciting new start for the series. With a fresh cast of characters joined by a handful of familiar faces, it’s a welcoming point for potential new fans to jump in while also rewarding veteran players for returning. Daybreak’s updated hybrid battle system still has a few kinks to work out with its real-time elements, but enhanced movement options and other impressive tweaks make the turn-based aspects better than ever. Wrap that up in an engaging story full of political drama and a compelling new setting, and Daybreak is exactly what the Trails series needed to reach new heights."
  },
  {
    "name": "Lorelei and the Laser Eyes",
    "score": "9",
    "url": "https://www.ign.com/articles/lorelei-and-the-laser-eyes-review",
    "verdict": "Exploring Lorelei and the Laser Eyes’ forlorn manor feels both familiar and novel. Shoving playing cards and letters and other objects into my pockets in the hopes that they’ll help me decode a lock or solve some mystery down the line would fit right at home with the best of the classic point-and-click adventure game genre, but the lovely, low-fi presentation, eerie story, and creative puzzles wrapped around that are all impressively fresh. An unwavering dedication to being a one-button game adds some unnecessary annoyances, but it doesn’t stop it from being a captivating journey just the same. Like all the best puzzle games, it had me frantically scribbling symbols, numbers, and names on physical pieces of paper just to make sure I left no otherworldly stone unturned."
  },
  {
    "name": "Bodycam Early Access",
    "score": "5",
    "url": "https://www.ign.com/articles/bodycam-early-access-review",
    "verdict": "Bodycam is a mostly competent multiplayer shooter and what you can see through the limited field of view of the titular bodycam looks great, but the narrow perspective manages to strike an unfortunate imbalance of being both in the way of good action and immersion-breaking. When all the elements align, like during tense games of Team Deathmatch on some strong maps, it can feel grounded and rewarding to wrestle the kickback of its punchy weapons and score a few one-shot kills before the enemy can line up their own shot, but too much of the time it feels in need of major reworks and rebalancing – especially the terrible respawn system in Deathmatch and when you get killed because you got caught on a tiny obstacle. If there were meaningful progression, like more interesting cosmetics than the paltry ones available or something to chase beyond climbing up a leaderboard then I would be more inclined to stick it out and see how things develop over time. But as it is, Bodycam is an interesting tech demo and little else, so you’ll probably want to wait for it to be fleshed out before jumping in."
  },
  {
    "name": "The Rogue Prince of Persia Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/the-rogue-prince-of-persia-review-early-access",
    "verdict": "With a slick presentation and an incredibly fun combat system, all the right pieces are here for The Rogue Prince of Persia’s success. But while running on walls and zooming through enemies are fast-paced joys, the repetition you’ll face and the faint whisper of a story that loosely ties things everything together wear thin far too quickly as of its Early Access launch. It will undoubtedly be fascinating to watch The Rogue Prince of Persia fill out as time goes on, but  both bug fixes and more of pretty much every good thing need to be equal priorities in its upcoming updates to move the needle to something great. Some of that has already arrived, so I’m at least optimistic The Rogue Prince of Persia could have what it takes to one day become the next major roguelite favorite, but it’s pretty far from that goal where it sits now."
  },
  {
    "name": "Elden Ring: Shadow of the Erdtree",
    "score": "10",
    "url": "https://www.ign.com/articles/elden-ring-shadow-of-the-erdtree-dlc-review",
    "verdict": "FromSoftware says Shadow of the Erdtree is the only expansion Elden Ring will get, so it’s fortunate that it’s hard to imagine a better DLC than this – as long as you’re not hoping for it to do anything radically outside the box. Everything I loved about the original has been condensed into an incredibly tight package – one that’s the size of many standalone games all on its own, and can only be considered “small” in comparison to the absolutely massive world of Elden Ring itself. Erdtree’s absolutely jam-packed with secrets, valuable treasures, challenging boss battles, and horrific monstrosities to face off against, as well as cool new weapons, spells, Ashes of War, Spirit Ashes, talismans, and more to play around with and use to find even more novel ways to tackle its memorably brutal battles. Add on some very interesting lore revelations, not to mention the same spectacular visual design and stellar music that accompanies its larger-than-life bosses, and you’ve got what is certainly one of the best DLC expansions I’ve ever played."
  },
  {
    "name": "Still Wakes the Deep",
    "score": "6",
    "url": "https://www.ign.com/articles/still-wakes-the-deep-review",
    "verdict": "I want to give Still Wakes the Deep all the credit it deserves for its fantastic art, dialogue, voiceover work, and setting. But it's frustrating to play with its nearly on-rails structure that actively scoffs at the idea of exploration. And as much as I wanted to be freaked out by it, I almost never was, trying as I might to set the mood as best as possible. It's the kind of game where I think watching someone else play through it and playing it yourself would be nearly identical experiences, and that doesn't make it easy for me to recommend."
  },
  {
    "name": "Shin Megami Tensei V: Vengeance",
    "score": "8",
    "url": "https://www.ign.com/articles/shin-megami-tensei-v-vengeance-review",
    "verdict": "I was more than happy to revisit Shin Megami Tensei V, one of my favorite games of 2021, through this definitive version. Vengeance doesn't necessarily make drastic improvements per se, but I enjoyed the new twists, content, and quality of life upgrades it does bring all the same. And while the storyline and route exclusive to Vengeance are a bit better than the original, their appeal as a returning player is really just in how they shake things up at certain points. Don’t get it twisted, though – there’s never been a better time to play this hard-nosed RPG, if not for its satisfying turn-based combat, then for its masterful execution of a uniquely demonic world. There’s a certain attitude that comes through vividly in its art style, character design, and music that you just don’t get in other games. So, if you're simply looking for more SMT or have yet to experience Atlus’ devilish RPG series, Vengeance is absolutely worth seeing through."
  },
  {
    "name": "Destiny 2: The Final Shape",
    "score": "9",
    "url": "https://www.ign.com/articles/destiny-2-the-final-shape-review",
    "verdict": "Destiny 2’s potential was clear from the first time I blasted my way through The Red War seven years ago, but Bungie never actually realized much of that potential until The Final Shape. This finale expansion’s story largely succeeds at delivering a satisfying ending, the raid is brutal and epic, the Prismatic subclasses breathe fresh life into combat, and the new enemy faction adds some much-needed variety to the things you’ll spend hours shooting in the face. None of that makes Destiny’s avalanche of confusing RPG systems, currencies, and storylines any easier to digest – but for the first time in a long while, I can wholeheartedly recommend pushing through that darkness, because there’s now a bright and beaming light at the end of the tunnel."
  },
  {
    "name": "Alan Wake",
    "score": "8",
    "url": "https://www.ign.com/articles/alan-wake-ii-night-springs-dlc-review",
    "verdict": "Alan Wake II: Night Springs is a compact collection of standalone stories that veer from entertainingly violent shootouts, to tense stretches of survival horror, before settling on and reveling in the utterly batshit craziness that makes Remedy’s multiverse of madness so keenly absorbing to explore. There’s admittedly not much new here from a gameplay perspective, and it feels like a bit of a tease to play as a version of Control’s heroine stripped of her special abilities in the second episode. Even so, the highs I felt during my short return to Alan Wake’s universe greatly outweighed the lows, and I’d gladly play through another collection of bite-sized side stories if Remedy ever decided to bake another batch. Could there be more Night Springs in the future? Hope springs eternal."
  },
  {
    "name": "Wuthering Waves",
    "score": "7",
    "url": "https://www.ign.com/articles/wuthering-waves-review",
    "verdict": "Wuthering Waves combo-heavy action, mobility, and monster taming enhance combat and exploration enough to respectably distinguish it from competitors. Its combat is polished and sophisticated, rewarding reactivity and pushing me to carefully consider my builds and teams. On top of that, the Echo equipment system ties your character progression into the environment in a way that encourages exploration, which can be satisfying despite the repetitive process of fighting overworld mobs. Unfortunately, the story is a bland, exposition-heavy slog, with dull writing and voice acting that rarely kept me interested. But while the quests may not be what’s pulling me along, I’m still looking forward to checking back in with the next major update to see how Wuthering Waves evolves."
  },
  {
    "name": "MultiVersus",
    "score": "7",
    "url": "https://www.ign.com/articles/multiversus-review",
    "verdict": "MultiVersus is an entertaining and deep platform fighter, but everything outside of simply jumping into a 1v1 or 2v2 match as any one of the eclectic characters in its cast (who are only related by a common corporate overlord) is tedious. I’ll keep coming back to experiment with my Iron Giant’s perk build for team play or learn how to use Marvin The Martian to his fullest, but I’d be glued to this game if I was given more opportunities to earn memorable variant skins or challenge my skills in increasingly tough PvE battles. Instead, MultiVersus offers days of grinding to earn the opportunity to grind more to attain its most enticing rewards, whether that’s the chance to play as an upcoming character or to swag out your favorite fighter. While it’s a huge boon that the actual fighting is solid and worth the time to dig into, it’s going to take more fun objectives to complete and more fruitful rewards to make me want to return over and over again."
  },
  {
    "name": "Disney Dreamlight Valley",
    "score": "8",
    "url": "https://www.ign.com/articles/disney-dreamlight-valley-review",
    "verdict": "After more than a year since its original debut, Disney Dreamlight Valley is still pretty great, with cartoonish and colorful areas to explore and loads of charming characters to meet. Hanging out with a growing roster of Disney icons is a remarkably good time, and some of the recent additions, like Gaston, made my return to the valley an even more worthwhile venture. But a lot of the shortcomings from the Early Access days haven’t necessarily improved much either, including its habit of leaving stories on a cliffhanger ending, a monstrous grind that just don’t quit, and bugs that continue to plague an otherwise good time. Still, there’s something undeniably riveting about chilling with the goofy oddballs and loveable toons from Disney’s impressive catalog, and returning to this zen-like simulator washed my troubles away like few cozy games can."
  },
  {
    "name": "Killer Klowns from Outer Space: The Game",
    "score": "7",
    "url": "https://www.ign.com/articles/killer-klowns-from-outer-space-the-game-review",
    "verdict": "Killer Klowns From Outer Space: The Game is as silly and entertaining as the movie that spawned it, and that makes for a surprisingly compelling asymmetrical multiplayer game to boot. The back-and-forth between the wacky, murderous Klowns and the whiny teens is a blast no matter which side of the equation you find yourself on, and unlockable classes and abilities add some much needed variety… for a little bit, at least. After a handful of hours, once you’ve tried out all the human and Klown options and learned the layouts of the small number of maps, that competitive loop can get pretty stale. Here’s hoping developer Illfonic has some tricks up their baggy, checkered sleeves and can deliver updates to keep the clown car chugging along beyond that, but for now Killer Klowns makes for at least a dozen hours of really enjoyable hijinks."
  },
  {
    "name": "xResist",
    "score": "9",
    "url": "https://www.ign.com/articles/1000xresist-review",
    "verdict": "When all the pieces fall into place, 1000xResist paints a beautifully messy, often cruel, but brutally honest picture of who we are. It’s an invitation to see a deeply personal and mature reflection of the Asian diaspora, dissecting the immigrant experience to show something much greater than simple representation. It’s profound without ever being pretentious, unapologetically sentimental without excess, and bittersweet in intimate moments without losing sight of its radical politics. While all that is a testament to its impeccable writing, its artistic vision creates a striking sense of place for its characters to become more than just their functions. 1000xResist is a revolution in storytelling, forged by the things that have shaped our lives, and in turn, one that shows us what it takes to shape our future."
  },
  {
    "name": "F1 24",
    "score": "7",
    "url": "https://www.ign.com/articles/f1-24-review",
    "verdict": "In isolation, F1 24 remains a slick, deep, and marvellous motorsports experience. If you’re a racing gamer who’s just getting into F1 (or an F1 fan who’s just getting into gaming) it’s terrific stuff, packed with options, assists, and various other tweakable toggles to make it hugely approachable to F1 fans of all skill levels. However, if you’re a returning player of F1 23, and F1 22, and so on, it’s hard to deem F1 24 essential. Despite its refurbished career mode and handling overhaul, it’s basically a neck and neck finish with the last few years’ versions. And when you have a head start, that’s kind of a loss."
  },
  {
    "name": "Capes",
    "score": "8",
    "url": "https://www.ign.com/articles/capes-review",
    "verdict": "Capes’ clever and challenging take on superhero-flavored turn-based tactical combat gives you all of the information you need to turn the tables on its villains. Watching the action figure-like characters combine their powers and supercharge their diverse ultimate abilities sells their teamwork well, and chasing optional objectives in each mission gives you a lot to think about to counter a wide range of enemy types. Stealth missions don’t work quite as well but they’re mostly optional, and the story, heroes, and villains are entertainingly written throughout the substantial campaign."
  },
  {
    "name": "Senua's Saga: Hellblade",
    "score": "8",
    "url": "https://www.ign.com/articles/senuas-saga-hellblade-ii-review",
    "verdict": "Senua’s Saga: Hellblade II delivers a spellbinding adventure packed with cinematic spectacle and story surprises that maintains a surging sense of forward momentum and never wastes a second of its slender run time. Its combat manages to feel consistently intimidating and immediate despite its mechanical simplicity, and its perspective-based puzzles regularly scratch cerebral itches even though they largely rehash or rework concepts from Senua’s previous story. A journey as brutal as it is beautiful delivered with hardware-pushing visuals and persistently absorbing audio, Senua’s Saga: Hellblade II is another Viking-worthy feast for the senses that meets the high bar set by its predecessor, even if it never really manages to clear it."
  },
  {
    "name": "Sins of a Solar Empire 2",
    "score": "5",
    "url": "https://www.ign.com/articles/sins-of-a-solar-empire-2-review",
    "verdict": "In its current state, Sins of a Solar Empire 2 is hard to recommend. On the one hand, it’s clearly not ready for prime time, despite what the Epic Game Store page and post-1.0 version number would have you believe. It’s buggy, makes no effort to teach you how to use its huge number of very complex systems, its menus are weirdly and counter-intuitively arranged, and there isn’t even a server browser. On the other, all of this confusion comes on top of what is a very faithful follow-up to a beloved real-time 4X game from more than a decade ago, and Ironclad has added some cool new ideas to it on top of the under-the-hood and graphical improvements. Sins 2 can be pretty fun with a friend once you figure out how most things work and your massive fleet is blowing some poor guy’s home planet to Kingdom Come, but man, does it take a long time to get there. Maybe when it arrives on Steam with the features we’ve been promised, Ironclad Games will have (ahem) ironed out all these problems and atone for the sin of releasing it prematurely and hoping nobody noticed."
  },
  {
    "name": "Gray Zone Warfare Early Access",
    "score": "6",
    "url": "https://www.ign.com/articles/gray-zone-warfare-early-access-review",
    "verdict": "Gray Zone Warfare’s early access version has some excellent ideas for a highly realistic take on an extraction shooter, but most of them come with a caveat or two at this point. Yes, the map is huge, lush, and full of enemies to shoot at, but you will need to be prepared to wait far too long for rides to and from objectives. The damage system is realistic and immersive, but it shoots itself in the foot with unreliable hit registration, and playing wounded is a lot less fun. The detailed weapons are painstakingly true to life, with lots of great customization options, but if you don’t already subscribe to Soldier of Fortune magazine it’s going to be tough to make great use of it. The enthusiasm and ambition behind this game is palpable, even if it is currently rough, buggy, and too often unreliable. But like a greasy burger at a roadside dive, its charm isn’t in craftsmanship, it’s in the earnestness. While its flaws are a bit too numerous to list, much less completely overlook, it can hit the spot just right if you have the right sort of hunger."
  },
  {
    "name": "Homeworld 3 Multiplayer",
    "score": "8",
    "url": "https://www.ign.com/articles/homeworld-3-multiplayer-review",
    "verdict": "Homeworld 3’s multiplayer modes deliver both a safe, traditional skirmish sandbox that we expect from any RTS and also a more novel, three-player co-op mode in War Games. The fact that the two factions are only slightly asymmetrical and the map selection is so slim makes skirmishes feel a little barebones, though as always Homeworld's three-dimensional strategy gameplay offers different opportunities to outthink your opponents in a style of competitive multiplayer battle you won't find elsewhere. Meanwhile, there’s a ton of immediate thrills and long-term potential in War Games thanks to its randomized upgrades that allow co-op partners to specialize their fleets to concentrate on taking down different types of threats and handle anything that might come their way."
  },
  {
    "name": "Homeworld 3 Single",
    "score": "8",
    "url": "https://www.ign.com/articles/homeworld-3-review-single-player-campaign",
    "verdict": "Homeworld 3’s campaign goes out of its way to change up the style of missions we fight our way through as Imogen S’jet seeks out a missing Hiigaran fleet and faces an unhinged enemy. The resulting battle of wills feels more consequential than the off-screen galactic threat behind it. Relatively close-quarters scenarios have you guiding dozens of ships through eye catching gauntlets of asteroids and enormous space stations, and the dogfights and capital ship slug-fests that play out are a sight to behold. Being able to pause time and give orders makes managing your fleet much less overwhelming, especially given the tricky controls and sometimes disobedient friendly ship AI. Straightforward tech upgrades and a limited selection of ship types limit the campaign’s replayability, but building an armada and watching it tear through the enemy is always a satisfying sci-fi light show."
  },
  {
    "name": "Fallout 76",
    "score": "7",
    "url": "https://www.ign.com/articles/fallout-76-review-2024",
    "verdict": "Fallout 76 has come a long way since 2018, transforming into something that’s much closer to the original “Fallout with Friends” pitch that was so enticing about it. The combat, exploration, and RPG systems all feel so good that it’s easy to lose dozens of hours running around the massive map getting lost in over-the-top action. That said, this wasteland still has plenty of room to grow, as its added Expeditions are less interesting than I’d hoped for, the endgame is still a bit thin, and the inventory system seems designed to infuriate – or worse, twist your arm into paying for a real-money subscription to ease the pain. Even still, I never thought I’d return to Appalachia after my initially harrowing experience with it, but Bethesda has really put in the wrench time on this one, and I’m so glad I gave it another shot."
  },
  {
    "name": "Animal Well",
    "score": "9",
    "url": "https://www.ign.com/articles/animal-well-review",
    "verdict": "Animal Well is a veritable feast of brain teasers that’s far more concerned with twisting your mind into knots than any grueling platforming challenges. It’s lovely to look at thanks to gorgeous pixel art and dynamic lighting, and an excellent use of haptics and well-tuned physics systems make it fun to touch, too. Animal Well’s steadily unlocked toybox of tools thoroughly rewards play, curiosity, and experimentation for hours upon hours after the credits roll. Though that late-game maze of mind-teasers might grate once in a while if you’re reluctant to ask for help, the massive onion of Animal Well’s secrets remains dense, clever, and thrilling even when you’ve peeled back as many layers as you think you possibly can… and then peeled a few more beyond that."
  },
  {
    "name": "Little Kitty, Big City",
    "score": "7",
    "url": "https://www.ign.com/articles/little-kitty-big-city-review",
    "verdict": "Little Kitty, Big City is an undeniably cozy and mechanically minimal game tailor-made for cat lovers. Its small but inviting sandbox can provide a few hours of ticking objectives off a list before any repetition sets in, allowing this feline adventure to stretch its exploratory legs before wearing out its welcome. Its graphics are cute and delightful, especially for people who just like to watch their pets leap into boxes or trot along when they realize they are not supposed to be in the kitchen. What’s missing are a few layers of polish on its movement and camera controls, which can make climbing around this city more frustrating than it needs to be. And while the campaign may be brief, being a street-level cat discovering the world a few blocks at a time easily holds up across it."
  },
  {
    "name": "Stardew Valley",
    "score": "10",
    "url": "https://www.ign.com/articles/stardew-valley-review-2024",
    "verdict": "Stardew Valley is not only the best farming game I’ve played, it is one of my favorite games of all time. That myself and others keep returning to this eight-year old gem each time it gets even the smallest update speaks to how it’s truly a masterpiece in the genre it both reinvigorated and has come to define. It is chock-full of bizarre and memorable characters, moments, and conversations, not to mention a neverending to-do list that fuels the completionist in me. It’s also an intensely strategic adventure, using its cozy farming activities and cute pixel art to make the deeply engaging time management challenge underneath it all effortlessly inviting. Stardew Valley has earned a spot on your platform of choice as a modern classic, standing proudly alongside gaming’s all-time greats. I’ve played countless hours already and will surely play countless more, because every time I boot it up, it feels like coming home."
  },
  {
    "name": "V Rising",
    "score": "9",
    "url": "https://www.ign.com/articles/v-rising-review",
    "verdict": "V Rising has been nicely polished up during its dark slumber in Early Access, allowing it to fully rise to the occasion with its excellent boss design and challenging ARPG combat. Keeping the killing rays of the sun and your dwindling blood supply as ongoing concerns is effective and evocative in selling the vampire fantasy, as is the ability to craft the sprawling, spooky estates of my nightmares. And the huge amount of customization available when setting up your own private server practically eliminates the need to do chores that are timed to real-world days in a way that only really makes sense for playing with a larger clan and having those timers going even when you're not online. Arise, ye children of the night, and sink your teeth into one of the best ARPGs – and one of the best vampire games, in general – of this moonlit age."
  },
  {
    "name": "Hades 2 Early Access",
    "score": "9",
    "url": "https://www.ign.com/articles/hades-2-early-access-review",
    "verdict": "Hades 2 feels impossibly huge and unbelievably polished by any standard, much less an early access game. Mel is awesome, the new tweaks to the combat and progression are excellent,  and its just unbelievably feature packed with twice the content of the first. Despite that, it is clearly still a work in progress: There are some placeholder art assets; there are still more weapon aspects to come, there’s a weapon missing from the arsenal of a six, there’s currently no proper story ending, and there’s still another planned region that will be part of the next major update in the next few months. But even with all that it’s currently missing, what’s here right out of the gate is astounding, and the thought of more coming on the way is a tantalizing treat."
  },
  {
    "name": "Another Crab’s Treasure",
    "score": "8",
    "url": "https://www.ign.com/articles/another-crabs-treasure-review",
    "verdict": "Another Crab’s Treasure is one of my favorite soulslikes in quite some time. It borrows a lot from the usual genre playbook, but adds a colorful, irresistibly charming, and wholly unique veneer that makes it all feel brand spanking new. The story is well-written and filled with memorable moments and characters, the shell-swapping mechanic is unique and adorable as heck, and the unrelentingly cheerful mood is like finding land after years adrift in an angsty sea of Bloodborne imitators. Its combat isn’t the deepest ocean around and it has a bit of jank here and there, but Another Crab’s Treasure is so clever and wonderfully ridiculous that it’s absolutely worth your time."
  },
  {
    "name": "Sand Land",
    "score": "6",
    "url": "https://www.ign.com/articles/sand-land-review",
    "verdict": "I'm happy to see Sand Land get a second wind with an open-world action game, and it can sometimes adapt the series in impressive ways. But while there is the potential of an interesting expansion of the manga here, it doesn’t manage to replicate what Toriyama's panels were able to illustrate so effectively. Beneath some ho-hum dialogue and stilted cutscenes is a fun story with its heart in the right place, and Beelzebub and friends at least have the charisma to carry you through to the end alongside a quirky set of supporting characters and villains. Dialing in on vehicular combat and exploration pays off to both maintain the spirit of the original work and deliver some high points, but the quests themselves fall into repetition. Thus, Sand Land suffers the same fate we’ve seen in many other game adaptations of anime and manga – competent in several respects with a few moments of brilliance, but for the most part, a simply okay adventure that can only occasionally capture what makes the source material special."
  },
  {
    "name": "Manor Lords Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/manor-lords-review-early-access",
    "verdict": "Manor Lords is a gorgeous medieval city-builder that kept me occupied for hours building my perfect, cozy hamlets. But it's not the type of Early Access game that seems like all it needs is some spit and polish to be fully playable. No, it's definitely unfinished in several key, critical ways, notably lacking much of an endgame challenge or any way to put its flashy RTS battles to a real test. It's a great foundation, and I see a lot of promise here. But there was only so much fun I was able to squeeze out of such an incomplete demo. I will definitely be keeping my eye on Manor Lords and eagerly awaiting each new update, but I also wouldn't blame you if you decided to hold off on striking the earth for now. That's not a dig at all. I said the exact same thing about Baldur's Gate 3 when it first released into Early Access, and it eventually came full circle to become one of my favorite games of all time. But I have to be realistic about what's here right now – and it’s somewhat less than what would allow me to recommend it wholeheartedly."
  },
  {
    "name": "TopSpin 2K25",
    "score": "7",
    "url": "https://www.ign.com/articles/topspin-2k25-review",
    "verdict": "TopSpin 2K25’s chunky career mode may occasionally be marred by periods of grind amidst its Grand Slams, its licensed player roster is a little slight compared to its impressive stable of stadiums, and its implementation of virtual currency attributes bafflingly unrealistic values to goods and services as though they were appraised by a kindergartner with no understanding of money. In spite of these drawbacks, though, TopSpin 2K25 is an absolute blast on court, and one that I’m struggling to put down. Claiming this is the best tennis simulation since Top Spin 4 may be a bit of a backhanded compliment since there haven't exactly been any other genuine serve-and-volley contenders released in recent years, but there’s little doubt that despite its rough edges this is still the most enjoyable way to get a realistic rally going in your own home without building an actual court in your backyard."
  },
  {
    "name": "Teenage Mutant Ninja Turtles Arcade: Wrath of the Mutants",
    "score": "6",
    "url": "https://www.ign.com/articles/teenage-mutant-ninja-turtles-arcade-wrath-of-the-mutants-review",
    "verdict": "How much you enjoy Teenage Mutant Ninja Turtles Arcade: Wrath of the Mutants will depend on what you’re looking for in a beat ‘em up. If you just want something easy to play so you can laugh along with friends while you’re all splitting a New York pie on your couch, you’ll probably have a good time for the hour and change it takes to burn through it. If you’re looking for something more mechanically nuanced, like TMNT: Shredder’s Revenge or Streets of Rage 4, you’ll probably be hungry for more after the credits roll. What’s here feels good, but I wish there was more of it, and the lack of online co-op is a total bummer, dude. It’s like a two-dollar slice of pizza you pick up while walking home in New York City after a night on the town: it hits the spot in the moment, but it’s not gonna fill you up for long."
  },
  {
    "name": "No Rest for the Wicked Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/no-rest-for-the-wicked-review-early-access",
    "verdict": "No Rest for the Wicked is a compelling and unique action-RPG that blends a whole bunch of great genre ideas into one promising package, even though its incompleteness can be felt throughout the abridged early access version’s story. With lots of loot and inventory shortcomings, some technical issues, and some isometric camera angles that take getting used to, there’s still plenty to tweak in the months of development to come before 1.0. I, for one, hope the balance of inventory management and grinding health items tips back more in favor of getting you into the action of its skill-based combat. But even in this early state – before co-op multiplayer even arrives – I’ve had an absolute blast with the precise and challenging combat, memorable exploration, and art, voice acting, and characters that make me really eager to see more of the story and further explore the high-risk, high-reward roguelike mode. With so much going for it already, I could easily see this becoming a landmark game for action RPGs, and that potential is exciting."
  },
  {
    "name": "Tales of Kenzera: Zau",
    "score": "7",
    "url": "https://www.ign.com/articles/tales-of-kenzera-zau-review",
    "verdict": "The worst thing I can say about Tales of Kenzera: Zau is that it’s platforming and level designs are fun, clearly inspired by some of the best Metroidvanias around, but don’t really produce any moments that rival those inspirations. Its combat, though also simple and familiar, manages to sing thanks to a small but meaningfully offering of different skills and enemies. And that action is ultimately just a satisfying break from the main attraction: a truly moving tale about how to go on in this world when your loved ones have passed on to the next."
  },
  {
    "name": "Eiyuden Chronicle: Hundred Heroes",
    "score": "7",
    "url": "https://www.ign.com/articles/eiyuden-chronicle-hundred-heroes-review",
    "verdict": "One you get past its slow start, Eiyuden Chronicle: Hundred Heroes mostly succeeds in weaving the stories of multiple countries and characters together into a sprawling epic. Its turn-based combat system operates smoothly, even if other modes like its strategy RPG battles can encourage simplistic strategies over critical thinking. And while collecting and experimenting with its titular hundred heroes can be entertaining, you won’t get to know the majority of them because of how much screen time they need to share with this bloated cast. Still, there’s plenty of satisfying side quests and castle building to fill in the gaps, which makes Hundred Heroes eventually feel worth the journey."
  },
  {
    "name": "Harold Halibut",
    "score": "8",
    "url": "https://www.ign.com/articles/harold-halibut-review",
    "verdict": "It may take place at the bottom of the ocean on a distant alien planet, but Harold Halibut’s story is an entirely human one, both in terms of its carefully handmade environments and its strong emphasis on empathy towards its eccentric cast of characters. While I wish that there was a little more interactivity to be found throughout its subaquatic setting, and Harold’s shuffling run could have been boosted to a sprint to reduce the time spent repeatedly schlepping from one end of its levels to the other, I nonetheless remained captivated by his whimsical quest to unite his community and explore the spectacular surroundings of his sunken home. Consistently funny and full of surprises, Harold Halibut is a wholesome, handcrafted adventure with plenty of heart."
  },
  {
    "name": "Broken Roads",
    "score": "4",
    "url": "https://www.ign.com/articles/broken-roads-review",
    "verdict": "Broken Roads is an ambitious RPG that can’t meet the expectations it sets for itself. It asks you to invest in an intricate morality system only to not end up making good use of it, giving you choices that don’t lead to much. A lot of this could be forgiven if the story held up, but there really isn’t much of a story to begin with, despite the philosophical angle Broken Roads tries very hard to get across. Couple this disappointing journey’s interesting but poorly executed ideas with pointless and often busted combat, and Broken Roads lives up to its name in all the wrong ways."
  },
  {
    "name": "Children of the Sun",
    "score": "7",
    "url": "https://www.ign.com/articles/children-of-the-sun-review",
    "verdict": "Strip essentially everything out of the Sniper Elite series except the bullets – then make the bullets magic and capable of steering, stopping, and speeding up – and you’re maybe four-fifths of the way to understanding what Children of the Sun is. Either way, puzzle-shooter is probably too broad a term to adequately describe it, which makes it a rare commodity. That is, it’s weird, and it’s different, and it’s not really like anything I’ve played before. However, while this slickly-packaged and shrewd supernatural sniping game is packed with satisfying spatial problems to solve (and shoot), once you’ve had success on a map there’s not a great deal to glean from trying it again."
  },
  {
    "name": "Botany Manor",
    "score": "8",
    "url": "https://www.ign.com/articles/botany-manor-review",
    "verdict": "Clever clues entwine with Botany Manor’s charming old English setting to make a lighthearted first-person puzzler worth tending to. Figuring out how to grow its fantastical plants kept me on my toes, and the blossoming flora painting onto the pages of my herbarium with bright colors gave me a comforting sense of achievement. I was more invested in deciphering its puzzles than I was reading the notes and letters that make up its fairly one-note story, but the variety of surreal seeds with unique traits in each new area gave an exciting cadence to the somewhat repetitive act of tracking down clues. Botany Manor is a laid-back game that doesn’t ask you to do too much, simply grow some strange plants and decompress – and sometimes that’s exactly what you need."
  },
  {
    "name": "Astra: Knights of Veda",
    "score": "6",
    "url": "https://www.ign.com/articles/astra-knights-of-veda-review",
    "verdict": "Astra: Knights of Veda’s intriguing mystery and engaging combat had me wishing I could enjoy it more than I did, but its sluggish progression and unintuitive user experience made this RPG feel like it was fighting against me. The beginner rewards are reasonable enough that it's fairly safe to check out as a free-to-play game, but be warned that the best of its story doesn’t come around until at least the halfway point of the campaign. Anyone taking on this adventure will need the patience to learn the layers of systems, grind to high enough levels to survive its hardest enemies, and come back even after your game inevitably crashes. It’s a tough ask, but one that’s worth at least looking into if you’re interested in a darker take on an anime fantasy RPG."
  },
  {
    "name": "Pepper Grinder",
    "score": "7",
    "url": "https://www.ign.com/articles/pepper-grinder-review",
    "verdict": "Like its diminutive main character, Pepper Grinder may be a little on the short side, but even this small pinch of Pepper still packs plenty of punch. Plowing through platforms feels fantastic, no two levels ever seem the same, and there are some wonderfully destructive toys to discover and employ along the way. I do wish the boss fights outside of the final encounter were a bit more challenging, and the lack of anything meaningful to buy in the in-game store meant I didn’t feel compelled to take too many return trips through each world to collect any missed currency and extend my playtime. But if you’re in the mood for a short but sweet slice of propulsive platforming action of a kind rarely seen since Ecco the Dolphin’s last adventure, Pepper Grinder is all driller and no filler."
  },
  {
    "name": "Open Roads",
    "score": "6",
    "url": "https://www.ign.com/articles/open-roads-review",
    "verdict": "Propelled by a star-studded cast and charming retro world, Open Roads' tale of family tragedy stumbles over its heavier themes, delivering an earnest but ultimately safe road trip mystery. Pottering through meticulous environments full of kitschy decor was at least enough to keep me entertained for its short runtime. However, with sharp teeth and no bite, I was left hungry for something meatier and more emotionally charged by the time the credits rolled."
  },
  {
    "name": "Outpost: Infinity Siege",
    "score": "7",
    "url": "https://www.ign.com/articles/outpost-infinity-siege-review",
    "verdict": "Outpost: Infinity Siege takes some pretty big swings with its mishmash of ideas, and succeeds at a surprising number of them – whether it's the insanely dense RPG mechanics, its tight FPS gunfights, or its open-ended base-building options. It certainly doesn’t stick the landing everywhere, with a dreadful story, overly grindy and RNG-driven progression, and levels that become monotonous and predictable after a few visits. But even so, I found myself gladly sinking dozens of hours into a delightfully weird and unpolished adventure that’s unlike anything I’ve ever played before. Not everyone is going to have the patience to learn the sometimes incoherently complicated systems required to get the most out of Infinity Siege, but those willing to make the effort are in from a very good time."
  },
  {
    "name": "Millennia",
    "score": "5",
    "url": "https://www.ign.com/articles/millennia-review",
    "verdict": "I felt the same way finishing up a game of Millennia as I did finishing a game of Humankind: It made me want to play Civilization 5 again. Several have tried to claim the turn-based history crown at this point, but none have done it better than Firaxis. And while things like city needs, National Spirits, and production chains allow Millennia to stand out, they don't really let it stand up under its own weight. I think Percy Shelly said it best: Round the decay of that colossal wreck, limited game set-up options, horrid late-game performance, and a cumbersome tile economy, the lone and level sands stretch far away."
  },
  {
    "name": "South Park: Snow Day!",
    "score": "3",
    "url": "https://www.ign.com/articles/south-park-snow-day-review",
    "verdict": "Thanks to recent successes, we know exactly what a great South Park game looks like, and South Park: Snow Day! couldn’t be farther from it. I’m a huge fan of throwing out the rulebook to try something completely fresh, especially in this age of samey sequels and forever live-service games that increasingly play it safe, but this bold attempt at a new direction misses the mark so drastically I’m aghast at just how sideways things went. Whether it’s due to the thoroughly unenjoyable combat or the uncharacteristicly toothless and unfunny story, I can’t recommend anyone waste their time on this cooperative lost cause – even my fellow die-hard South Park fans."
  },
  {
    "name": "Dragon's Dogma 2",
    "score": "8",
    "url": "https://www.ign.com/articles/dragons-dogma-2-review",
    "verdict": "Dragon’s Dogma 2 is a strange and wonderful game that seems haunted by some of yesteryear’s bugaboos. It is a retelling and reimplementation of all of those wonderful ideas from the 2012 cult-classic, including an awesome dynamic world and some of the best combat in the genre that integrates a subtle but amazingly complex physics system. On the other hand, its finicky ally AI, clunky climbing, choppy frame rate, and camera with a habit of going haywire at the worst times are all “features” I wish hadn’t been brought back for another round. Even so, there’s an action-RPG here that’s richly rewarding and incomparable to its contemporaries if you can be patient with its quirks and open to embracing its hands-off open-world and quest designs."
  },
  {
    "name": "Alone in the Dark",
    "score": "6",
    "url": "https://www.ign.com/articles/alone-in-the-dark-review",
    "verdict": "Like a Louisiana voodoo priestess, Alone in the Dark is not without its charms, but its basic combat lacks the flexibility and function of Resident Evil 4, its inventive narrative is never as mind-bending as Alan Wake II, its uninspired creature design can’t compete with Dead Space, and it’s not nearly as scary as any of them. Its central mystery intrigued me enough to lure me through its strand of imaginative settings all the way to its story’s end as Edward, and its puzzle design did feel consistently rewarding, but I was disappointed to discover that there wasn’t a substantial enough difference to make a repeat playthrough as Emily feel particularly worthwhile. While this remake is undoubtedly a step up from the three-decades-old original, Alone in the Dark fails to escape the shadows of the other contemporary survival horror titans that it helped spawn."
  },
  {
    "name": "Backpack Battles Early Access",
    "score": "6",
    "url": "https://www.ign.com/articles/backpack-battles-early-access-review",
    "verdict": "Backpack Battles has a strong foundation, smartly mixing the satisfying puzzle of inventory organization with some clever RPG elements and autobattler combat. The systems and ideas in place offer something refreshing, although its current barebones state leaves a lot of potential on the table. As it stands, there's a noticeable lack of content and few reasons to come back to it after you've seen everything once. What's there is enjoyable, though, with plenty of room to grow, and my time with the Early Access build of Backpack Battles has me excited to see it do just that."
  },
  {
    "name": "Tribes 3: Rivals Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/tribes-3-rivals-early-access-review",
    "verdict": "Tribes 3: Rivals is a return to form for a series I’ve long-adored that absolutely nails the most essential parts of this iconic high-speed murder fiesta – but in its current Early Access state, it’s also missing a whole lot that its predecessors pulled off so well, from alternate game modes to vehicles. I’ve had a blast relearning the ropes and becoming a badass titan of the skies once more, despite weird party size limitations and the odd bug here and there, and I’m hopeful the planned ongoing development will make this a more fully featured sequel. But for now, much like controlling the jetpack-powered commandos it stars, Tribes 3 is a really fun time that threatens to run out of fuel quite quickly."
  },
  {
    "name": "Lightyear Frontier Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/lightyear-frontier-early-access-review",
    "verdict": "Lightyear Frontier is already a fun farming and crafting game that takes some pretty simple genre basics and makes them exciting again by putting you in a big ol' stompy robot suit. Things can start a little slow and the story definitely ends too early as of its Early Access launch, but the charming world to explore and make your own outshines its current limitations."
  },
  {
    "name": "Outcast: A New Beginning",
    "score": "7",
    "url": "https://www.ign.com/articles/outcast-a-new-beginning-review",
    "verdict": "Thanks to its wildly customizable weapons and versatile Iron Man-like jetpack, Outcast: A New Beginning actually does feel like the start of an open-world adventure that’s different from pretty much everything else out there. It’s clearly not a big-budget game, but the freedom it gives you and its ability to laugh at itself make up for a lot of its weaknesses, such as character animations and some overly long questlines filled with busywork. Once you get to know the Talans and appreciate their goofy sci-fi babble, this becomes a charming and colorful world to spend a few dozen hours blasting robots in."
  },
  {
    "name": "Contra: Operation Galuga",
    "score": "6",
    "url": "https://www.ign.com/articles/contra-operation-galuga-review",
    "verdict": "Contra: Operation Galuga met my expectations as a marginally modernized run-and-gun arcade game, but it almost never exceeded them. All eight levels do a solid job of playing to my Contra nostalgia, and small tweaks to combat like the weapon upgrade and overload systems add a couple of much-needed wrinkles to its otherwise extremely faithful formula. But with only a few hours worth of things to do and very few surprises to be found, the rollercoaster comes to a halt too quickly and doesn’t have many drops or loop-de-loops to enjoy."
  },
  {
    "name": "Balatro",
    "score": "9",
    "url": "https://www.ign.com/articles/balatro-review",
    "verdict": "Remarkably approachable with complex systems waiting for those willing to lose themselves to it, Balatro successfully assembles the infinitely fun gameplay loop that every great roguelike sets out to create. It takes the fundamentally simple nature of poker’s scoring hands and shuffles in deep mechanics that don’t feel like a chore to learn but are always thrilling to exploit. A deck-builder of endlessly satisfying proportions, it's the sort of fun that threatens to derail whole weekend plans as you stay awake far too late staring into the eyes of a jester tempting you in for just one more run. Simply put, Balatro is no joker, but in fact, ace."
  },
  {
    "name": "Nightingale Early Access",
    "score": "6",
    "url": "https://www.ign.com/articles/nightingale-early-access-review",
    "verdict": "Nightingale has a lot of good ideas at its Early Access launch, but they all seem to come with unfortunate caveats. The ability to create and jump to different types of realms offers almost limitless exploration, but it also means they all feel too much like the same randomized bits smashed together. The setting and concept is really interesting, but not much is done with it yet outside of your charming guide, Puck. There’s an excellent crafting system that ties seamlessly into your overall progression, but that progress is halted with painfully long periods of fetching materials and farming Essences too often. Nightingale is almost equal parts fun and infuriating, and as interesting as it is to explore the Fae Realms, anyone taking the plunge right now should be prepared for some frustration."
  },
  {
    "name": "Expeditions: A MudRunner Game",
    "score": "8",
    "url": "https://www.ign.com/articles/expeditions-a-mudrunner-game-review",
    "verdict": "Expeditions: A MudRunner Game certainly isn’t a replacement for the supremely addictive SnowRunner, but its more untamed wilderness maps and huge truckload of exploration-focused missions do see it function as a very worthwhile complementary experience – despite some aggravating mission gating and a bit of an unfriendly map screen. Its unique brand of slow-paced bushwhacking won’t ever be for everybody, but successfully taking a truck on a trek through terrain that the toughest trailblazers would fear to tread is still an oddly satisfying challenge that proves the journey is always more important than the destination."
  },
  {
    "name": "The Thaumaturge",
    "score": "8",
    "url": "https://www.ign.com/articles/the-thaumaturge-review",
    "verdict": "The Thaumaturge is a slow, text heavy caper that is often curious and sometimes captivating, weaving revolutionary labor politics and mysticism together to create a unique and charming piece of historical science fiction. It is eurojank through and through, filled with criss-crossing systems like gathering observations, Thaumaturge abilities, and combat that are all fun and engaging despite the sometimes hitchy controls, clunky conversations, and odd voice overs that make this journey a bumpy one. But if a little jank didn’t stop you from enjoying RPGs like Vampyr or The Witcher, you’ll be well equipped for this otherwise exciting ghost story."
  },
  {
    "name": "The Outlast Trials",
    "score": "7",
    "url": "https://www.ign.com/articles/the-outlast-trials-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-outlast-trials-review"
  },
  {
    "name": "Terminator: Dark Fate",
    "score": "5",
    "url": "https://www.ign.com/articles/terminator-dark-fate-defiance-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/terminator-dark-fate-defiance-review"
  },
  {
    "name": "Sons of the Forest",
    "score": "9",
    "url": "https://www.ign.com/articles/sons-of-the-forest-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/sons-of-the-forest-review"
  },
  {
    "name": "Last Epoch",
    "score": "8",
    "url": "https://www.ign.com/articles/last-epoch-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/last-epoch-review"
  },
  {
    "name": "Pacific Drive",
    "score": "7",
    "url": "https://www.ign.com/articles/pacific-drive-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/pacific-drive-review"
  },
  {
    "name": "Helldivers 2",
    "score": "9",
    "url": "https://www.ign.com/articles/helldivers-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/helldivers-2-review"
  },
  {
    "name": "Skull and Bones",
    "score": "7",
    "url": "https://www.ign.com/articles/skull-and-bones-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/skull-and-bones-review"
  },
  {
    "name": "Deep Rock Galactic: Survivor Early Access",
    "score": "8",
    "url": "https://www.ign.com/articles/deep-rock-galactic-survivor-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/deep-rock-galactic-survivor-review"
  },
  {
    "name": "Atomic Heart: Trapped in Limbo",
    "score": "3",
    "url": "https://www.ign.com/articles/atomic-heart-trapped-in-limbo-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/atomic-heart-trapped-in-limbo-review"
  },
  {
    "name": "Banishers: Ghosts of New Eden",
    "score": "7",
    "url": "https://www.ign.com/articles/banishers-ghosts-of-new-eden-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/banishers-ghosts-of-new-eden-review"
  },
  {
    "name": "The Inquisitor",
    "score": "6",
    "url": "https://www.ign.com/articles/the-inquisitor-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-inquisitor-review"
  },
  {
    "name": "Suicide Squad: Kill the Justice League",
    "score": "5",
    "url": "https://www.ign.com/articles/suicide-squad-kill-the-justice-league-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/suicide-squad-kill-the-justice-league-review"
  },
  {
    "name": "Granblue Fantasy: Relink",
    "score": "8",
    "url": "https://www.ign.com/articles/granblue-fantasy-relink-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/granblue-fantasy-relink-review"
  },
  {
    "name": "Persona 3 Reload",
    "score": "9",
    "url": "https://www.ign.com/articles/persona-3-reload-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/persona-3-reload-review"
  },
  {
    "name": "Palworld Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/palworld-review-xbox-game-pass",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/palworld-review-xbox-game-pass"
  },
  {
    "name": "Enshrouded Early Access",
    "score": "8",
    "url": "https://www.ign.com/articles/enshrouded-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/enshrouded-review"
  },
  {
    "name": "Stargate: Timekeepers",
    "score": "8",
    "url": "https://www.ign.com/articles/stargate-timekeepers-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/stargate-timekeepers-review"
  },
  {
    "name": "Palworld Early Access",
    "score": "8",
    "url": "https://www.ign.com/articles/palworld-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/palworld-review"
  },
  {
    "name": "Like a Dragon: Infinite Wealth",
    "score": "9",
    "url": "https://www.ign.com/articles/like-a-dragon-infinite-wealth-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/like-a-dragon-infinite-wealth-review"
  },
  {
    "name": "Tekken 8",
    "score": "9",
    "url": "https://www.ign.com/articles/tekken-8-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/tekken-8-review"
  },
  {
    "name": "Turnip Boy Robs a Bank",
    "score": "8",
    "url": "https://www.ign.com/articles/turnip-boy-robs-a-bank-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/turnip-boy-robs-a-bank-review"
  },
  {
    "name": "Prince of Persia: The Lost Crown",
    "score": "8",
    "url": "https://www.ign.com/articles/prince-of-persia-the-lost-crown-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/prince-of-persia-the-lost-crown-review"
  },
  {
    "name": "Supernormal",
    "score": "6",
    "url": "https://www.ign.com/articles/supernormal-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/supernormal-review"
  },
  {
    "name": "Rocket Racing",
    "score": "6",
    "url": "https://www.ign.com/articles/fortnite-rocket-racing-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/fortnite-rocket-racing-review"
  },
  {
    "name": "Silent Hill: Ascension",
    "score": "5",
    "url": "https://www.ign.com/articles/silent-hill-ascension-mid-season-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/silent-hill-ascension-mid-season-review"
  },
  {
    "name": "The Finals",
    "score": "8",
    "url": "https://www.ign.com/articles/the-finals-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-finals-review"
  },
  {
    "name": "Warhammer 40,000: Rogue Trader",
    "score": "8",
    "url": "https://www.ign.com/articles/warhammer-40000-rogue-trader-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/warhammer-40000-rogue-trader-review"
  },
  {
    "name": "Resident Evil 4 Remake",
    "score": "8",
    "url": "https://www.ign.com/articles/resident-evil-4-remake-vr-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/resident-evil-4-remake-vr-review"
  },
  {
    "name": "Granblue Fantasy Versus Rising",
    "score": "9",
    "url": "https://www.ign.com/articles/granblue-fantasy-versus-rising-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/granblue-fantasy-versus-rising-review"
  },
  {
    "name": "Cookie Cutter",
    "score": "7",
    "url": "https://www.ign.com/articles/cookie-cutter-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/cookie-cutter-review"
  },
  {
    "name": "House Flipper 2",
    "score": "7",
    "url": "https://www.ign.com/articles/house-flipper-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/house-flipper-2-review"
  },
  {
    "name": "Fortnite Festival",
    "score": "4",
    "url": "https://www.ign.com/articles/fortnite-festival-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/fortnite-festival-review"
  },
  {
    "name": "Lego Fortnite",
    "score": "7",
    "url": "https://www.ign.com/articles/lego-fortnite-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/lego-fortnite-review"
  },
  {
    "name": "The Day Before Early Access",
    "score": "1",
    "url": "https://www.ign.com/articles/the-day-before-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-day-before-review"
  },
  {
    "name": "The Anacrusis",
    "score": "4",
    "url": "https://www.ign.com/articles/the-anacrusis-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-anacrusis-review"
  },
  {
    "name": "Avatar: Frontiers of Pandora",
    "score": "7",
    "url": "https://www.ign.com/articles/avatar-frontiers-of-pandora-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/avatar-frontiers-of-pandora-review"
  },
  {
    "name": "Arizona Sunshine 2",
    "score": "8",
    "url": "https://www.ign.com/articles/arizona-sunshine-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/arizona-sunshine-2-review"
  },
  {
    "name": "Lethal Company Early Access",
    "score": "7",
    "url": "https://www.ign.com/articles/lethal-company-early-access-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/lethal-company-early-access-review"
  },
  {
    "name": "The Walking Dead: Destinies",
    "score": "2",
    "url": "https://www.ign.com/articles/the-walking-dead-destinies-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-walking-dead-destinies-review"
  },
  {
    "name": "SteamWorld Build",
    "score": "7",
    "url": "https://www.ign.com/articles/steamworld-build-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/steamworld-build-review"
  },
  {
    "name": "Bluey: The Videogame",
    "score": "4",
    "url": "https://www.ign.com/articles/bluey-the-videogame-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/bluey-the-videogame-review"
  },
  {
    "name": "Flashback 2",
    "score": "2",
    "url": "https://www.ign.com/articles/flashback-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/flashback-2-review"
  },
  {
    "name": "Naruto x Boruto Ultimate Ninja Storm Connections",
    "score": "5",
    "url": "https://www.ign.com/articles/naruto-x-boruto-ultimate-ninja-storm-connections-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/naruto-x-boruto-ultimate-ninja-storm-connections-review"
  },
  {
    "name": "Call of Duty: Modern Warfare 3 Zombies",
    "score": "6",
    "url": "https://www.ign.com/articles/call-of-duty-modern-warfare-3-zombies-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/call-of-duty-modern-warfare-3-zombies-review"
  },
  {
    "name": "Assassin's Creed Nexus",
    "score": "7",
    "url": "https://www.ign.com/articles/assassins-creed-nexus-vr-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/assassins-creed-nexus-vr-review"
  },
  {
    "name": "Modern Warfare 3 Multiplayer",
    "score": "6",
    "url": "https://www.ign.com/articles/call-of-duty-modern-warfare-3-multiplayer-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/call-of-duty-modern-warfare-3-multiplayer-review"
  },
  {
    "name": "The Last Faith",
    "score": "7",
    "url": "https://www.ign.com/articles/the-last-faith-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-last-faith-review"
  },
  {
    "name": "Persona 5 Tactica",
    "score": "8",
    "url": "https://www.ign.com/articles/persona-5-tactica-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/persona-5-tactica-review"
  },
  {
    "name": "My Time at Sandrock",
    "score": "8",
    "url": "https://www.ign.com/articles/my-time-at-sandrock-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/my-time-at-sandrock-review"
  },
  {
    "name": "For the King 2",
    "score": "6",
    "url": "https://www.ign.com/articles/for-the-king-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/for-the-king-2-review"
  },
  {
    "name": "Nickelodeon All",
    "score": "9",
    "url": "https://www.ign.com/articles/nickelodeon-all-star-brawl-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/nickelodeon-all-star-brawl-2-review"
  },
  {
    "name": "Like a Dragon Gaiden: The Man Who Erased His Name",
    "score": "7",
    "url": "https://www.ign.com/articles/like-a-dragon-gaiden-the-man-who-erased-his-name-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/like-a-dragon-gaiden-the-man-who-erased-his-name-review"
  },
  {
    "name": "Call of Duty: Modern Warfare 3 Single",
    "score": "4",
    "url": "https://www.ign.com/articles/call-of-duty-modern-warfare-3-single-player-campaign-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/call-of-duty-modern-warfare-3-single-player-campaign-review"
  },
  {
    "name": "The Talos Principle 2",
    "score": "8",
    "url": "https://www.ign.com/articles/the-talos-principle-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-talos-principle-2-review"
  },
  {
    "name": "The Invincible",
    "score": "5",
    "url": "https://www.ign.com/articles/the-invincible-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-invincible-review"
  },
  {
    "name": "Thirsty Suitors",
    "score": "8",
    "url": "https://www.ign.com/articles/thirsty-suitors-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/thirsty-suitors-review"
  },
  {
    "name": "RoboCop: Rogue City",
    "score": "7",
    "url": "https://www.ign.com/articles/robocop-rogue-city-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/robocop-rogue-city-review"
  },
  {
    "name": "Dead Island 2: Haus",
    "score": "6",
    "url": "https://www.ign.com/articles/dead-island-2-haus-dlc-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/dead-island-2-haus-dlc-review"
  },
  {
    "name": "The Lord of the Rings: Return to Moria",
    "score": "4",
    "url": "https://www.ign.com/articles/the-lord-of-the-rings-return-to-moria-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-lord-of-the-rings-return-to-moria-review"
  },
  {
    "name": "Alan Wake",
    "score": "9",
    "url": "https://www.ign.com/articles/alan-wake-ii-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/alan-wake-ii-review"
  },
  {
    "name": "Stray Souls",
    "score": "4",
    "url": "https://www.ign.com/articles/stray-souls-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/stray-souls-review"
  },
  {
    "name": "Ghostrunner 2",
    "score": "9",
    "url": "https://www.ign.com/articles/ghostrunner-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/ghostrunner-2-review"
  },
  {
    "name": "Cities: Skylines 2",
    "score": "6",
    "url": "https://www.ign.com/articles/cities-skylines-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/cities-skylines-2-review"
  },
  {
    "name": "Laika: Aged Through Blood",
    "score": "9",
    "url": "https://www.ign.com/articles/laika-aged-through-blood-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/laika-aged-through-blood-review"
  },
  {
    "name": "Hellboy Web of Wyrd",
    "score": "6",
    "url": "https://www.ign.com/articles/hellboy-web-of-wyrd-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/hellboy-web-of-wyrd-review"
  },
  {
    "name": "Skull Island: Rise of Kong",
    "score": "3",
    "url": "https://www.ign.com/articles/skull-island-rise-of-kong-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/skull-island-rise-of-kong-review"
  },
  {
    "name": "Wizard with a Gun",
    "score": "6",
    "url": "https://www.ign.com/articles/wizard-with-a-gun-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/wizard-with-a-gun-review"
  },
  {
    "name": "Endless Dungeon",
    "score": "8",
    "url": "https://www.ign.com/articles/endless-dungeon-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/endless-dungeon-review"
  },
  {
    "name": "Hot Wheels Unleashed 2: Turbocharged",
    "score": "8",
    "url": "https://www.ign.com/articles/hot-wheels-unleashed-2-turbocharged-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/hot-wheels-unleashed-2-turbocharged-review"
  },
  {
    "name": "Sonic Superstars",
    "score": "7",
    "url": "https://www.ign.com/articles/sonic-superstars-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/sonic-superstars-review"
  },
  {
    "name": "Star Trek: Infinite",
    "score": "5",
    "url": "https://www.ign.com/articles/star-trek-infinite-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/star-trek-infinite-review"
  },
  {
    "name": "Lords of the Fallen",
    "score": "8",
    "url": "https://www.ign.com/articles/lords-of-the-fallen-review-2023",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/lords-of-the-fallen-review-2023"
  },
  {
    "name": "Total War: Pharaoh",
    "score": "8",
    "url": "https://www.ign.com/articles/total-war-pharaoh-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/total-war-pharaoh-review"
  },
  {
    "name": "Cricket 24",
    "score": "5",
    "url": "https://www.ign.com/articles/cricket-24-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/cricket-24-review"
  },
  {
    "name": "Assassin's Creed Mirage",
    "score": "8",
    "url": "https://www.ign.com/articles/assassins-creed-mirage-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/assassins-creed-mirage-review"
  },
  {
    "name": "Forza Motorsport",
    "score": "8",
    "url": "https://www.ign.com/articles/forza-motorsport-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/forza-motorsport-review"
  },
  {
    "name": "Station to Station",
    "score": "8",
    "url": "https://www.ign.com/articles/station-to-station-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/station-to-station-review"
  },
  {
    "name": "High On Life: High on Knife",
    "score": "6",
    "url": "https://www.ign.com/articles/high-on-life-high-on-knife-dlc-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/high-on-life-high-on-knife-dlc-review"
  },
  {
    "name": "Avatar: The Last Airbender",
    "score": "4",
    "url": "https://www.ign.com/articles/avatar-the-last-airbender-quest-for-balance-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/avatar-the-last-airbender-quest-for-balance-review"
  },
  {
    "name": "Cocoon",
    "score": "9",
    "url": "https://www.ign.com/articles/cocoon-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/cocoon-review"
  },
  {
    "name": "The Lamplighters League",
    "score": "7",
    "url": "https://www.ign.com/articles/the-lamplighters-league-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-lamplighters-league-review"
  },
  {
    "name": "Wargroove 2",
    "score": "8",
    "url": "https://www.ign.com/articles/wargroove-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/wargroove-2-review"
  },
  {
    "name": "Super Bomberman R 2",
    "score": "7",
    "url": "https://www.ign.com/articles/super-bomberman-r-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/super-bomberman-r-2-review"
  },
  {
    "name": "Mineko's Night Market",
    "score": "5",
    "url": "https://www.ign.com/articles/minekos-night-market-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/minekos-night-market-review"
  },
  {
    "name": "The Making of Karateka",
    "score": "9",
    "url": "https://www.ign.com/articles/the-making-of-karateka-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-making-of-karateka-review"
  },
  {
    "name": "Resident Evil 4: Separate Ways",
    "score": "9",
    "url": "https://www.ign.com/articles/resident-evil-4-remake-separate-ways-dlc-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/resident-evil-4-remake-separate-ways-dlc-review"
  },
  {
    "name": "Cyberpunk 2077: Phantom Liberty",
    "score": "9",
    "url": "https://www.ign.com/articles/cyberpunk-2077-phantom-liberty-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/cyberpunk-2077-phantom-liberty-review"
  },
  {
    "name": "Mortal Kombat 1 For Switch",
    "score": "3",
    "url": "https://www.ign.com/articles/mortal-kombat-1-for-switch-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/mortal-kombat-1-for-switch-review"
  },
  {
    "name": "Payday 3",
    "score": "7",
    "url": "https://www.ign.com/articles/payday-3-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/payday-3-review"
  },
  {
    "name": "Mortal Kombat 1",
    "score": "8",
    "url": "https://www.ign.com/articles/mortal-kombat-1-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/mortal-kombat-1-review"
  },
  {
    "name": "Party Animals",
    "score": "7",
    "url": "https://www.ign.com/articles/party-animals-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/party-animals-review"
  },
  {
    "name": "The Crew Motorfest",
    "score": "7",
    "url": "https://www.ign.com/articles/the-crew-motorfest-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-crew-motorfest-review"
  },
  {
    "name": "Dune: Spice Wars",
    "score": "9",
    "url": "https://www.ign.com/articles/dune-spice-wars-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/dune-spice-wars-review"
  },
  {
    "name": "Lies of P",
    "score": "8",
    "url": "https://www.ign.com/articles/lies-of-p-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/lies-of-p-review"
  },
  {
    "name": "Starfield",
    "score": "7",
    "url": "https://www.ign.com/articles/starfield-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/starfield-review"
  },
  {
    "name": "Trine 5: A Clockwork Conspiracy",
    "score": "8",
    "url": "https://www.ign.com/articles/trine-5-a-clockwork-conspiracy-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/trine-5-a-clockwork-conspiracy-review"
  },
  {
    "name": "Sea of Stars",
    "score": "8",
    "url": "https://www.ign.com/articles/sea-of-stars-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/sea-of-stars-review"
  },
  {
    "name": "Armored Core 6: Fires of Rubicon",
    "score": "8",
    "url": "https://www.ign.com/articles/armored-core-6-fires-of-rubicon-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/armored-core-6-fires-of-rubicon-review"
  },
  {
    "name": "Madden",
    "score": "6",
    "url": "https://www.ign.com/articles/madden-nfl-24-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/madden-nfl-24-review"
  },
  {
    "name": "Immortals of Aveum",
    "score": "8",
    "url": "https://www.ign.com/articles/immortals-of-aveum-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/immortals-of-aveum-review"
  },
  {
    "name": "Baldur's Gate 3 Final",
    "score": "10",
    "url": "https://www.ign.com/articles/baldurs-gate-3-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/baldurs-gate-3-review"
  },
  {
    "name": "Blasphemous 2",
    "score": "8",
    "url": "https://www.ign.com/articles/blasphemous-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/blasphemous-2-review"
  },
  {
    "name": "WrestleQuest",
    "score": "6",
    "url": "https://www.ign.com/articles/wrestlequest-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/wrestlequest-review"
  },
  {
    "name": "Shadow Gambit: The Cursed Crew",
    "score": "9",
    "url": "https://www.ign.com/articles/shadow-gambit-the-cursed-crew-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/shadow-gambit-the-cursed-crew-review"
  },
  {
    "name": "Gord",
    "score": "4",
    "url": "https://www.ign.com/articles/gord-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/gord-review"
  },
  {
    "name": "The Texas Chain Saw Massacre: The Game",
    "score": "6",
    "url": "https://www.ign.com/articles/the-texas-chain-saw-massacre-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/the-texas-chain-saw-massacre-review"
  },
  {
    "name": "Moving Out 2",
    "score": "8",
    "url": "https://www.ign.com/articles/moving-out-2-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/moving-out-2-review"
  },
  {
    "name": "Atomic Heart: Annihilation Instinct",
    "score": "6",
    "url": "https://www.ign.com/articles/atomic-heart-annihilation-instinct-review",
    "verdict": "...[extracted conclusion] Error: 429 Client Error: Too many requests for url: https://www.ign.com/articles/atomic-heart-annihilation-instinct-review"
  }
]